Rhxa8
Nfxg6
Rhb1
Kxd4
cxd2
Qb8
Q4xf5+
Nbxd5
Bxh8+
Bxh6+
Rhd1
Bh6
b5#
N1xe2
Q5e1
Ncxa2+
Q8xf7+
N4a5
Qbxc8+
Rcg6
Nxf3#
Re8#
Rxd6+
Rah7
Q3d7
Qgh4+
Q4e8+
Qcxf6
Qbxc3+
Nxe3#
f4
Bxg5
Rhxf3
Q7a6+
Qgg5+
Rhb3
e8=N
Rag7+
h3
Nhg5+
d2#
R5e4#
R5f7#
Qbxc8
Rdg1#
N6xd4
Q1a5+
Qcxd3+
Rhb2
R7xg5+
Ndxc8+
Bg7
R3e5#
gxh8=N
Nxb7#
Qhxh2#
N4d5
Ngxe4+
R7e4
Rhd8
Rhxc4
R3xd7
Qfd8+
R5d3+
Q6g5
Rxb3#
Qce5+
Rc6
R4c5
R5f7
Reg4#
Ndc2#
Rexe1
Bd2+
hxg3#
R8xe7
Rbxg5
Nfd5#
Qexa7
Bxf2
N1xg3
R8xh4+
Nb7+
Nxg3+
R1d2+
Raxc5
Nxh8
Rh6
R7xd2+
Rbf6
Qhh5+
R4xb6
Rdxa6+
R7d2
R2b7+
Nxg7#
b8=N+
N2g3#
Nhxf1
R1xe5+
Kb3+
Qxb1+
Qff3
Qcg5+
Qhe4
Bxd7+
Rc1+
Q8a6#
Rc3#
Bac5
R8c2#
Raf8
Rbxc2+
cxd3
Qb8#
bxa8=N+
e8=R+
Ned3+
Rhxd6+
gxf8=B
N1xh3
h3+
Nce7+
Nef6#
R4xb5+
Bcd8
Rae4
g1=Q
Q7f6
Nxd1#
Rea4
N7xa6+
exf4+
Qh8#
Be6+
Qgb3
Kxe6
N7xa6
N6c4
Kxf6
Ned8+
Qaa8#
Nh3#
Rdg2+
Qdd7+
Qdf2
Nexc4+
Qhxf8+
Qcc4+
Q6b6
N5a4+
Qda8#
R4xg7
g7
f1=R#
Rhxc7
Nce8
R7xe2
N4xg5
N4g3
Raxa3#
Qdd6#
Nxc3
Rdg3
Qcxd3
Rexf4+
Bef4
Nhg6
Bb3
Raxf7+
Qxe6#
Nxh7#
Qxa5+
Qxg7
Qcf5+
Rxc6
Rdxe5+
Qff7+
c8=Q#
Rbxc2#
R7xb6
Nbxd2+
Nxb5
Qhd4
Qbc2+
R7f6
Qxf6
Rhc1+
Raf1#
Qfg3
Rexd1
R7xh6
Qhd7+
Qhd4#
Rgxg1
a8=Q#
g1=B+
Nxh3
Q6a2+
Rbd5+
R5xd6+
Qdf4
Q1f2
Qh2
Rge6+
Nde8+
Rgf5
N5f3
Bxc2#
Rbxc1+
Rdf1#
Red2+
Qxh5#
cxb1=Q#
N4h6
Rbf7
Qcd2
Qfxg6#
Rhe7#
Kf7
Nfg4
R4xd2+
Qh5#
Nbxa5
Q5b2+
R4xc6+
Rfc4+
N8xc6
Nxa1+
Q4f3
R5c3#
Rhe4
Rbxd4+
Rh3#
Rexh8
R3xd5
R3xe6+
Rxh6#
Qed5+
Qdf5+
Qhg3
e3
Rag1
Bg2#
b5
Qcxc6
Qgh5+
Qeh4+
Q1xe5+
Q1a6+
Qdb2#
N8xd7
Q5d1
Qch2#
R6xb3
Qbxe1+
N2f3
Nfxd5
Bg1#
R2xe4+
Qxb8#
R5e4
Raxb8#
Q1h1#
N6xg5
R7e5+
Q1b4+
R7f2
R4c2
Bf1
dxe5
axb2#
R7f5#
Qdxe2+
e3+
R6xb3+
Qhd4+
g8=R+
Qag8
Bg3+
Bd8#
Rgf6+
R1xg5+
Rhxe4
R4c5#
Ndxc6
Nfh1
R8xb4+
R8b5
R1xh5+
R6xe2+
Qch8
Qaxd4
Q8g3
Ngxf5
R5f2+
Nge6
Q4xa4
Bxd1+
Rdxc6+
Qhc8#
Qh3
Rcxf4#
Q3g8+
Nxf6
Raxf6
Qfc5
Rc8
Neg6
R2xd6
d3#
Nf5
fxg1=N
Rcxa2+
Kg4+
Qeh8#
Kg3
axb5#
Rcxg8#
bxa3
Qdxf8#
Qba3+
Qhxh4#
Rbc1#
Rxa1
Rac4
Nfd4
Rga1
Na8+
N3c5+
Ree2+
Qdxf6
Qexb4#
Rce4+
Qaf6+
Q7d8
Bxf4+
Q4e6
Nge2+
Rgb7#
R7xc3
Kxa2+
Rfe6#
R2b6+
Nb8
Rd2+
Red4
R1g5
R3c4+
Nexc6+
Qfxe4+
Raxg5
Qbf6+
Qab5
Rad6
Nxh4+
Ba5
R6xd5
R8xc5
Q6c7+
Rxg8+
Ngxf4+
Qc1#
Qaa8
Ke4+
N5d4
Rc8#
Ne3#
gxf1=R+
Qbxa7
Qcc1+
Qba7
Qdh1#
Nbc7+
d1=N#
exf3#
Q3e2
Rch6
dxc1=R
Q8xd5+
Qag4
R7c2+
Qgxf2
N4h5+
Qbc3+
R2xh6
R8f2#
Qxc6+
Nd3#
Qhg7#
Bxe6
Rfxa4+
Rfd1+
Q1d2+
Qdh7#
f1=N
Qbg2+
Rgc2
cxd5#
Qcxe5+
Nxd3+
Qxe2
Nxb6
Q2b4
R8h2
Qde8+
bxa1=Q
Q3b6
Qgxg8
Qge7+
Nxd8+
exd8=Q+
Qxg6+
Raxb5
Rfa2
Qhg4
Rcxg5+
R4e5#
Ng1
Qdb8#
Kxc6
Rdxd1#
Qgh3+
axb1=R
R5a4+
Qca6+
Rexc7+
Qdg3+
Rdxd1+
R6d5
Qbxd8#
Rha4
Qcxf8
R4e7
Q5e5+
c8=Q
Kb7
Na4#
N6h5#
Qhxg4
Rbxc2
Rxc7+
Qeg3
Q1c6
Rg8#
Nhxf6+
Qac8+
R1d3#
Qc7+
Kd5+
h2
Rxc5
R3xa4+
Qxa5
Qdf8#
cxb7+
c7+
Nh7#
Rbxf7+
R3xh5#
Rgxe3
R7xe6+
Nfe1+
R1xf4
Rgg4
Qad6+
R5xa3
R4c7#
Rdg5
R1xg7
Qcxc4+
Qcxh6
Kxf4
N7xh5
g8=R#
Rgxc5
Qca3#
Qcd8#
Ne1+
Q5c4
Kh7
f8=N
N5xe6
Rexh7
R8h5
Nbc6
Qf4
R8xc6+
Qaxg5
Ndf2+
N6h5+
Nfg7+
R2b6
Raxf1+
N4xc5
Qhxd5
e1=B+
Nba4+
Rcb6#
Q3g5+
Rxh7#
Rfe7#
Naxb7
Kxc5
Kd1+
Kxc7+
Qdg8#
Nfh3
Qdb6#
R5g6#
Qfe4+
Rdc2#
Qcxc6+
N4a6
Qeg5+
Rhxd1
N5xh6+
Nxb8+
hxg1=N
Qaf1
Qxc7
Kf8+
Rhxb6
R4xe5
Rhd6
Kxf2+
N6h5
Rxc5#
Qde1
Qgxf5
R5b7
hxg8=R+
Qaxh2#
R4a7
R2d5+
Rxg2#
Rbc2
Ree8
Qgg6+
Qee1+
Q5e3+
Ncxe3+
Ng3+
Rcc8+
Rdxg2
R8xh5
Rdxe7
Q7d7
Rac6+
Reg7
Naxc7
Qcxg4
Bxh1
R8d2+
Qxh2#
Rdf8+
Ndc1
Qc6#
Qcxd2
N1b2
Qf1+
Rhh5
Bxe6+
Ngf5+
Qxb7#
Nba7
Qab8
Qbxc7+
fxg3
Rgd6+
Kxd7
N7d5
Nge3+
Qfxd3+
R3a7+
R8d5#
Qhd3#
N3a4
Rah1
Kxa3+
Qhg4+
cxb8=Q
Ngh6
N8xa6
Qfc6#
Qaxc7#
R4e2
Qaxa1
Raf6+
Q2e2
Bxe7
Q8xe7
N7e5+
exd3#
Nce5
Qe8#
R8c4+
Nc3#
Qexe4+
g8=Q
R4h3
Rbxa3
a8=R#
Qbc7#
Qcb5
Rfh7+
R3xg6
b4#
Rgxb1
Raxe7+
Qab8#
N5xg6+
N2xd3+
Qcxd2#
Nfxh4
Qcd5
Nfd1+
Rbxa5
N6xa4
Nd2+
N5xe6+
R2xc7+
Q1f4+
bxc8=Q+
Bxa5#
Rah4
Rdxf8+
dxc4
Rfxc8
Qff6
b8=Q
Rhxb2+
Rdxd7
Kc1
Nexd5
Q8a7#
Rfd6#
Qhg3+
Rfxe5
Rdb8+
R1e2
Ncxe7+
a1=R
Raxd6+
cxb1=Q+
Kxa5
Rfg5
Rxd2
R6xd5+
Rde6
Qbc5#
N5f6
fxg1=N+
Nca1
Qef3+
R8c2+
Rdxd3#
Ndb8
Qcxf8+
Rdf5+
fxe8=Q
Rcg7
R4g3
g2#
Nbxc8
R8a2#
Rbxe7
Re2#
Rbxf7
Q2xf1
Ree6
R4xf5
Rgxg3+
Nh5+
Qad7+
Rbxf1+
Kd4+
Rxg4+
R3a5
Rgb2
Qc5
Rfxf3+
N3xa5
Qbd8#
Nbd6#
Qae3
Q7b3
Rfb3+
Rfc2
Qef2#
R1h4+
Qda5
Kd2
Q1c5+
Rdc3
R8xe6
Q8b6
Rfxa6
Qgg6
R6xd4+
R5d7+
Qce6
Qad3
Rge1
Qbf8+
R2xb6
Qexd7+
Q7e3
Rgxh6
Q1d6+
Rb3+
Raxa6+
Ng2
R3g2
Nh2#
Rfxe3
Qgf4#
Naxc1
N6xh7
Kxf1+
Rbd4+
N5xe4
N6xg4
Rag2+
fxg8=B
Qdf1#
Rg4+
dxe3+
Q1e7+
Qxe1+
Rdg4
Qa4+
Qdxe8
Na3+
a7#
hxg8=N+
N8g6+
Qhf3
R6f2#
R6b2
Rgxb2+
Q8xd4
N5d3
Qeg3+
Rb5#
Bxb7#
Qcxa6#
Qf2#
Qgxg1#
f5
Qff6#
Rb7+
Rhe5
Rexe8+
Q2d5#
Bh6#
Rexc4+
Rfxh5+
N3e4
Qdc3+
R8d4#
Qexe7#
R7c3+
R1xh4
Q7f5+
Nd7#
R3a4
Qcxd7+
R1f4
g7+
N6c5+
R1xg2+
N2b3
Rfxh4+
R8b3#
N5xc4
dxc5
R3c6+
Nxd2#
Rgxh2
R5xe4+
Nf8+
Nxh5#
R2f6
R3b7+
Rgxd5
R7xb4
Nce5+
Qexf4
Q3d5#
Rec8#
Q8xh7+
Rgc7+
Nhf3#
Raf2#
Rexe4+
Rde7#
Nde2+
Qcxb8
R5c3+
Nexd6
Ncxb3+
R8xg3+
Ncxa3
Qee2#
R5b3
Qab3+
Qe5
cxd7+
Qce8
R8f7+
Rxf1
Ne2#
R1xf7+
Raxa8
Rexh2
R1xa3+
Ncb6+
Kg4
R8xc2
Rea2
Rdb3+
Qdxd3
Qfg2#
Rcxd4#
Rhxh8
Rcf1
Rad3+
Ncxa3+
Bxb6+
Rhg6+
Raxg6
Qgc8
Neg7+
Qhg2+
Qag2+
R8f6+
R3f7
Rfxf4#
Rcg8+
Ba4+
d1=N
N4f3
gxh7
Rbd5
R3c5+
Rfxb4+
Rfxf5+
Qfc6
Bxb6#
Rfxa2+
Q8d2+
Ndxc7+
R7xh3
Q4g3#
R3xb4
Q2a2#
Rec6#
Rag3
Rcxd2+
Rgxe1#
R7xb3
R7xd3
Nfxh8
exd4
Rdf2+
N6d7
Q5c6
exf3+
R8xa3+
Qgxf4
N5xf4+
Qg4#
Bxa7
Q4c5+
Rfxg1#
Neg1+
R4xh7
Nbc7#
Rgh4
Nexd7
Bxg8
Rhxb1
Qch8#
Kxc4
Qgd2+
Nfxd4
Nexd5+
Q5g7
Qxh1+
Q3g5#
b6#
Qhb3+
hxg5
Qch6#
Nhg2#
R1f7#
Qfb7
g3#
Qgxf7+
Qgxg4#
Rcf4
R6a4
Rhh2
Ndxf1
Nac8+
Qgf8+
Be2
Kb4
R3f4
R8xg2
Q8g7
Qah2#
R3f2#
Qe2+
Ref1
Qbxf2
Qcxd7
Rexa6+
Red3
Bhf6
Rdb2
Qed3+
R8a3+
Qaxb8#
Rcc8
Rgxe7+
R2xa4+
Rgxe3+
Rge3+
Rad1#
Rdf5
Qdh4#
N5d4+
Qexa3
Rexc8
R7xe6
N3xg5
Qba2
Rhg7+
Bxb8+
R3xf7
gxf1=Q#
Ned6
Rexb7
N7xb5
Q4h3+
N5xh6
R1xf3+
Ndb7#
Qcxh3#
Rxf6+
N6xc5
R8xg4+
Rd2#
Rda6
Nexf7
Nef8+
N5c6
Ref6+
Rexe5+
Qbd5
R3xg2+
Nxh1
Q1f2+
N5xc3
Reb1#
Rcd1#
R7xh4
N7g5
R6xg5+
Q2a4#
Rxc3#
Qef5#
Nf7#
R4xb3+
R6f5
Qcg3
Nxg6#
Rfd7#
a3#
Rhxa6+
R8xe5
Nf6
Rcxa7
R6a7#
hxg7+
R8xc2+
Kxb7
Rfd8#
Nfxe7+
Be5#
Ncd8+
Rbxh3
Qhh5#
N1e3+
Ngf8+
Qee7#
Qha8+
R1xe3+
R1a6+
Rxa1+
Rexa5
Qgxg3+
Rfxe4+
Qgg8+
Qhc8
N2xd4
Rfxb8+
Ncxa2
Ree3+
R2d7#
Nde1
R4g5
Qxb1
hxg2+
R7e6#
Rbd2#
Rfe1#
R7b2+
Rhxg5+
Qbc1+
Qbd3#
Rdc1+
Qhf6
Qxf4
Qfb7+
Rbe3+
Ncd5+
R3h2#
Qeh5+
Qdxd5+
Nb6#
Qbxe4+
Ndxf7+
Rfb1+
Q1b3#
R8f7
Ref5+
Bxd3#
Qgf6
Qfd6
Ba6+
Rxb5+
axb8=B
Bb3+
Q2g6
Rhc7+
Qhc1
Q7a7
R4b3+
hxg8=N
Rbe5+
Rhxh2#
Rhg4
Rge8+
R3xe2
Qdxg2+
Qxe2#
Rxa7+
Ne1
Bd4
e8=Q
fxe4
Rad4+
Rcd3+
Q2d5+
Qdg5
Bxe1
R2d7+
Rcg3
Q7d4
R4xg5+
Qfxf7
N5f6+
Bxc5
Q8xe6+
Rgxb4
Rxf4#
R1xa4+
Rgxf1+
N2xc4
Q8g7+
Qag7#
Qda8
Qc3#
Qec7
Ne6+
Nd3+
R1e3#
Q8f5#
Qxd2+
Ndxe8
Nxg3
R4xc3
Qaa7
Rexg6
Nec5
Ng4
N2g3
Q2xf4
Qbb1
Ba3+
Bb5#
hxg4#
R2xa5
Nxe2+
R1c6#
Bxf1
Qfxg1#
Rge2#
N4c5
Qaxb2
Bxc3#
Qdg2
Qgg3
R1xe7+
gxh4+
gxh2#
Bxb1+
Rdxh1
Qgxf7#
Rac7
Qgg8#
Qdxc7
Qbxd4+
Qgd6+
Nef2
Rxc1
Qxa3
Rbd3
R1a5
N2h4
Rhe5+
Qfe7#
R5a6
Rfxb4
Ne1#
Ndxc3
Q3b7+
Qae3+
Q1c4
Rge8
Nfxd3
Naxb8
R1xf7
R7g5
N6xb5+
Ned7
Qde7+
Rgxg4#
Rb6
Qfd1+
R7xd5
Rbxg8#
Qbh1+
Kxf7
R4h6
Q7f8
Q5a7+
Qhxh7#
R3a2
R5g3+
Kh7+
Bxd4#
Nd1#
Qed6#
fxe6#
R2xc3+
Q8e6
Rgb5+
R5f4
Qexe7
Nhxg6+
Nfh2+
Qxh3
axb8=Q+
Nxg2#
Rb6+
R4xh5
Rac1+
gxh2+
Rcg2#
R8xc5+
Rc8+
Rfxf1#
Qdxe8+
Rah2
Rgf4
Bxb7+
Ndxf8
b8=R#
Qeb6
Qec4#
Nxb5#
Kg7#
cxd5+
Qac7#
Qeh7#
Rexh2+
Qeg6+
Qbh1#
bxc1=B
N3xf4+
Qa3#
Qgxf7
Rgxb4+
Rhf1#
Nfd6+
Be3+
Qxb6+
cxb1=R+
Q7f4
gxh2
Qef1
Qdc2#
exd8=Q#
Raxe3
Rexf8
N5d6+
R8a6
Rbg7
Ne8#
Rcxa5
Bxf5+
e1=R+
Rbc5+
Rxc7#
Rgxh4
Qac3
N3xd5
R3b4+
Nde6+
N3b5
R1e5#
Qfxe6
R1f7+
cxd1=Q+
Kxc2
R3e2
Qd2
R6e7#
Nhf2#
Qhf7
Qxh1#
fxe1=B
Rdc6+
Qba5
R6xc7
Qxc7+
Qce2#
Q6f4+
Rxe1
R3g5
R8xb7+
Raxg3
Q5c7#
Nef3#
Rdh3
R7h6
R7a4
Bh7
Qab7+
Qcb7
Qac7+
Bc2+
axb2+
axb1=Q+
Rge4+
Qhe2
hxg8=Q#
Kc3
Nde4+
Kc7+
N5c4
exd1=B
Q6b2+
Rfc2#
Q4e7
Qgd8#
Neg3#
Qea3
N6xc5+
Red7#
Qbg7+
N8f6
R7xe5#
f3#
Rcc3
Nc3+
Qexe2
Bc2#
Ned3#
Rcd6
Bh5
R1b6+
R5xc6
Nhg2
Rag3+
Rg5+
Qa6
Bxd5
Q2xh7+
Q8xa8
Q3xb2#
N3c4
R4h2+
Kxd7+
Rdxe5
Qac4+
Rb2+
R4xg6+
Rcf2+
Nd6
Q8c3+
R1xc2+
dxc5#
Rgd1
Bxf2+
Qbb1#
Q4f4+
Rhb3+
N5xf4
Rexa1
Ref8#
Rxc7
R8xe7+
Rbd4
Rgxg7#
Q2d2+
N6xd5
Rgg7
Rbe2+
Nfh7
Ndxb2+
N7b5
N8xe7
Qab4
Bxa6
R1xd5
Rb1
Qeh2+
Q5d8
Rgxa2
Qfc7#
R8xf6+
Qa5+
Qad5+
Nxe5#
Nh6
Q5c3
Rfg4+
Rhb8+
Qhxf4
Rfxf3
R7c3
Ncd3+
N6d7+
Ncxb4
R3xg7+
Qxf3#
Rbb1
Rexb5+
N4b6+
Qdb1+
Rxb5#
Qxb6#
c1=Q#
R2xg5+
Qfg8+
Rhxe2+
Rg3#
Q5b6#
Ncd7#
Rcf8
Qxb5+
Qxa4#
Rdf4
N4d6+
Ba3
Ncxe5+
Rdxc5
Nfh5+
Qeb1#
R4f6#
Rxd7
R1xd4+
R1g6
N5xd6
Rgf1
Rac5+
Rcf7+
Q4xe4+
Rcc1
R2f4+
Qexc4
N8xa7
Qxd3
Qxd1#
Rdxe3
R8xc2#
R6g3#
Qgg6#
Rgxf2+
Raf4+
R8xh7+
Kf2
Qeb4+
Rad6#
Kxg3
Qdc2
N2b3+
Qbc4+
Qde2+
Nbc4+
R5b4
R5g2#
Qfd8
Rh2+
Raxg1
R1f2
Qcb6+
Qbf1+
Rcg8
Qde1+
Nxb3
b1=N+
Rexd5+
N1c3+
Qgxh5+
Nxc6#
Raxd1+
Ba4
R6c3
Rexg8#
dxe1=R
Rfd2+
Rfh7#
R4b2
Raxd2+
Ndb4+
Nxd3#
R8xh2+
a6#
R3f5
Rdxf4
Qexd5+
Rdb1
R6g4#
R4xg3
Nfxd2
N2c3
N6xb7
Rb4#
Qeh5#
Qexe6+
gxh8=Q#
Nd4
R4b7#
a1=Q+
Bxc6#
Qbxg6+
Qch7#
bxc8=N
Rdxe4+
Qfh5#
R8xh6+
Bb4#
Q7d7+
R5h7#
fxg4#
R7h4
Qdxe4+
Rgxd3+
Rcg4
R1xh6
Rxb7
Qxd8
N4xf3+
Rhc7#
b8=N
R6d2
Rcg4#
R3xg5+
b8=N#
Rdxf3+
Rcxe5+
N5h6
Raxf4+
Qbe2
Qfe4
Nxg7+
R8b6+
Q6e2
Qxf1
Qhf8+
R8xd2+
R8e6
Ngxe7+
Ne4+
Rd6
Ba2+
Nexg7
exd5
cxd4+
R8h6#
Ncxe3
R8e5+
Qeb5+
Rfg2+
Qgd3+
Rdd3
dxe6+
Qb3
Ke1#
Bxf6
Nhg2+
Rgf3+
fxg1=Q
R2e6+
Qga2+
Ref3#
Rgc7#
Bxd6+
Reb2
Rhc3#
gxh8=R
bxc2+
Qdxe2
R3a4+
f8=Q+
Qfh4+
Rgxd6#
Rg7
Rcxg7#
Ng5+
Qaxd3
Q6f3
Qgxg7#
Ba7+
R4xc3+
Raf6#
Rfxc4
Qcxg5#
R5xa2
Q7xa6#
Rdh5
Qaxf2#
Qg1#
Rfb1
Q6e3
d1=Q
Qfg2
Kxg6
R2e3
R2xh5
Rcd2+
Qce1+
Rbxf6
Nfe6
Bg2
dxc6+
Qexc6
N8xd6
Qfxd8#
Ncxb5
Qxd8#
Q1a6
Kxe8
R1a4+
Qac3+
e3#
Qab1+
N5c4+
Rhxh4#
Q8f3#
Qe6#
Ncxd6
exf4
Nge7
R2xf7
Qaxc3
N6f4+
bxc6
Qcf4
Rbc8+
Rfxc8+
Qb8+
R7xf2+
exd8=B
R2d5
Nfe7#
Qfe8+
N3xc5+
Nd8#
Rxe8+
Bb5+
Bxe4+
Q5f5+
Rhxg2
Qda4+
Re7
Kxf4+
R1xg3+
Bf5+
Ndxb1
Rbxf8+
Bed6+
Rdxd5#
Qeb1
R8xg3
Qdg4
Rfxd1+
R4xg5
Rde8
Qac8#
bxc1=Q#
Rfxf7
R1g5+
Rhe6
R5c2
R3g7#
Raf4
R4xg6
N6e5
Rec1+
Raxe6
R1xe2+
Nfg5+
Kg5+
Rfc7+
Bxh5
Qhxf2+
Qbf5#
R1g2
gxf4#
Raxh6+
Raxc3+
Qdxd7+
N4f6
N3g4
Qaa6
fxe8=N
Qhxd5+
Qhh1+
Q5c2+
Rbc3+
Qea1#
Rgb2#
Qhf6#
R3xc5
N5xf3
Kxa1
R1xc3+
Qha3+
Nhxg2
N4e3
Qfe6
Raxe4
Rhb5
Ndc5+
Rcxe7
Rexd6
cxb2#
Rdd2
Ke8
Nxf7
Q4xf3+
R4g3+
Rbf7#
N8c6
Nde4
Rbd1+
Rexd1+
Qaxd5
Qch7
R3h2+
Bxa6+
Rac8
Rxg3#
Ndf7#
Qa7#
Rfxc2+
cxb8=N
Rxb4+
Nxa7
Rxb1#
Rab3
Rhxa3
Q1a2
Ngxh5
Rbf6+
Rff3
Rgf3
Qb4+
Nh5
Qbf4
Nxf4#
Qag8#
Qeh7
N7e6
Qf2
Rgxf5
Q3d2+
Rgf8#
Nexd1
Nhf5#
N6b4
Rfb7
Rxg1
Rhc5+
Rhxc6
N6f7+
Ndxf5
Q6c2
Rexf2+
Nb6
Rc6+
c1=N+
Rdg4+
R6xf3+
Rexd3+
Rdxg7
Nbxa3+
bxc3+
Qcxa3
gxh1=Q#
Qed8
Kg6
Rbf5+
R1b6
Ra7+
Qxb5#
R3d5#
Bxg7+
Qhf1+
Qgb3#
a4
Bxh4#
bxc1=R#
Qbe1#
Qf6
Qexb4+
Qdd3#
Nxh5
Qc2#
R6h7
f7
Q1f4
Rgc2+
R1xa5
Rbe3
Nbxa1
Rdxg8
Rhxh5#
Nxf3+
Ndxe2+
Q4b1+
Rcxf3
Q4b4+
R7e4#
R4h5+
Nb5
Rac2
Rfxh3+
cxb4
Rdh4
R5g7#
Qhf8
R1c3#
exf5+
Kxg2+
Qhg2
Nce3+
Rc5+
Raa7
Rfxh3
R6xh7+
Qbd6
N4xa3
R7h5
Qhf2#
Rdxc7
R6xg3
Bf3
Rgd1+
Nc2
Rg6
Qdg8+
R6xc2+
Ngxf3
Q4d1+
N3xf2
N7xc6
R7d3+
Qbxb2
Bxh3#
Rdxf4+
Qdxg4+
Rbxb1+
Qac2+
Bxa3#
R4g6+
Qae6#
Bg7+
Qag7
R6b2+
Rbxa4
Rcd5+
Rec6
R1xh7+
Qd2+
f1=R
Qg3#
R5h3
Q8g5#
R1xe5
Qexg6#
Rb8+
R5g2+
Ncxe2
dxc8=R#
N7xf5
R3xe4+
bxc7+
gxf7#
Rcxc1#
Rcxa4
N8b7
Rcxd5
cxb5
Qxc3+
Rdxg1
Nfxe7
cxb8=Q#
Ra4
Nge5
Q8h5
R1a5+
Rexf7
N3b4
R8h2#
Qfxg3+
Qfd2
Nfxh3
Bxg1+
Rfe8
Rcg1
g8=B+
Qeg7+
Qd6+
Qcxg5+
R3g6#
Rca6+
Nab6
Qaxe1
Rbb8+
Rge3#
Nexd6+
Qbd4
Qee7
Bf8
Bd6#
Qbxb4+
Reg8
Kb8+
Rexg5+
Qff8+
Rcxc1+
Qhe7#
Rcxc6+
exf8=N
Rcxg2+
Rdf8#
h8=Q
Rca5
Rdxd5
Qac1+
Ncxb1
Raxb3
N7e6+
Nc7
Rxc2#
Bd3
Rgxh7
R6xb5
Nxd4#
Qaxa6+
Kxh1+
Qda2+
O-O-O
Ndxc5+
R8xh4
Q4e6#
Qgd6#
Q8d4
Rxd4
Rfxd5
R8d6
c1=R#
cxb8=R#
Qda7#
Rd7+
R4xa7
N4h3
Qhxf3
Nbc7
Qcg8+
R7f3
Qb1+
R5c4#
Qef6#
Rfa1
N3a4+
Nxf5#
f8=R#
Rd2
R3d6+
hxg5#
Rhg8#
Rad8
Na3
Rgc7
Rbxf2+
Rbxc3+
Kf6#
Kxb6
Qxb3
Kxd2
Qbb5#
Qexc5+
R5h7
Nbc6+
f8=N+
Rab8+
Rbxb2
R7a4+
N5a6
Naxc4+
Nge5+
Rgh2
Nbxd6+
R6a5
hxg4+
Ned4+
R3h5
R4c5+
Qhb1
Q2xc5
Rhxc3
Qaa7#
Nca5+
R2xb5+
Rgxe7
Rdb4+
g1=R#
Rfxb5
cxb4#
Qbc8
R2xf6
Qdxb4
gxf8=N#
Bb8
Qg6
N4g5+
R5a7+
Qfb8+
Nbxc6+
Qe6
Raxa7#
Qaxc3+
Qhxf6#
Rdxd6+
c6#
Q7f4+
Nhf4+
Rcd7
Kxh2+
Q1g6
R6h5
N5f6#
Q8d3
Qxc1+
R5e2
Bh5#
Rbh5
Nbd5
Rdxe1+
Ka8
Rfxf4+
R1xf7#
R4xe2
R2f5
Rhb7
gxh1=R+
Qec3#
fxe2+
N4xd5
Qfc1#
hxg6+
dxc6#
Rdb6
Qea4+
Q5b3
Rh2#
R5a4
Naxc3+
Qfg5#
Rba2
Rbc2+
Qhxd4
Qef1#
N3xb2
Rfg7+
Ne7
R8h2+
Qbd7+
Rdxc1+
Qhg2#
Qdh5#
Qaxb8
Rd5#
Rbxe4+
R6f5+
Ndb2+
Nhf7#
Rec5+
Nab7
Ke1+
R8xc3
Rbf2#
Bxg1
Qxf8#
Rdxc4+
Rde2+
Nac3#
Nfd3+
g6
N3xc5
Qhb8#
Kxb5
cxd3+
Qcxc5
Bb2
Rbxd3
Rexg4
Q1xd4
Qhh2+
Rgxc6+
Qcb4+
Q8xe8#
Rcxf7+
Qbxb6
Q7xg7#
Bh8#
fxe8=R+
Qxg1
Qaa2#
Qe4f5+
Qhxd2#
Bb1+
Ncb2+
Rexf6+
Qb4
Qfxd3
Rbxb8
Nxb3#
h1=B#
R7c2
Qf6+
Rfxg4+
Qexd6+
Nxd7+
Rbxf3+
Nc8
g8=B#
R2xe7
Qhh4
Q5a4
Qgxg5+
Be7#
N6g4+
d8=R
Q2c3
R6xa3+
Qaxf3
Nxf4
N4xh6
R8c2
Ba1+
Q3b4
Rg6#
Qfxe5
R3xb2+
R8xf4
Q2b7
Qeh5
Qf7
h8=Q+
Q1c7+
Qfb1#
Nxh2+
Rexb4+
Qcb6#
Q4d2+
Rhg2+
Rbxb3+
R4xh2
Rha6
dxc8=Q
Rdxa4#
Rbxd7+
Rbh3
N6xf5
Qaxe4
Rcxe3
R5b3+
N5e6#
Qec4+
R6xf5+
Rdxc1
Qh5
Qd4+
Naxb4
R8e4#
Qxd6#
Qd5#
Qbd2+
b6+
R8xg4
Rbxg3
Nce1+
Rcd8+
Rea3+
R8g6+
N4c6
Q6xd6#
Nec2
Rdxd3+
Qxb8+
Rbe1
Qxf6#
R2h7
Qcc6
R8e2+
Raxa7+
N3c5
Rfxb2
Rdf6
Bxe4
Rexa3+
Bf8#
Re7+
hxg1=R#
Rexd7+
Q8c3
R6a7+
Rdxa7
Ba8
R2a4+
Bxh1+
Nc4#
Rcf4#
bxa7
exd5#
Qea6#
Nxc2+
Qfxg7#
R2xh3
R7a6
R1d6+
R6xe4
Qbb5
R5xg6
Qch5
Reh7
exd1=R+
Qxb5
Nfxd6
Q6d4+
Ncxb5+
Rxb1
Qe4+
Qhe7+
Qhxf7
Rbg4
Nxh4
Nb8+
Q3d7+
Ref8+
Rge6#
Ke8+
Qfxf6+
exd6+
Rcxb4
Rfxc7
R4xd6
R3xc7
Rxf7#
R4xh3
Ka1+
Bxe2#
Qxe4
R4d6
R8xe6+
Raxd8+
Be4+
Rhc4
Nb1
Qgxg6+
R2g6
Rdxf8#
h1=Q#
Nac1+
Rgh3
c8=N+
N5e6+
f2#
Qd8+
Qxa4+
Q7e7
Rfxa4
R1c4#
Qbc4
N2h4+
Ndxc3+
Ndxe8+
f1=B
Qhxh6#
Qff7
N3xe4+
Nfg2#
Qbb1+
Bxd6
Rcg6#
Rhf4
Nxh3#
Qexe4
Qfc2+
Q3c6+
Qdxc5
R3e7
Q5d2+
Qaxb1+
N2h3+
fxg8=B+
Rbxf4
R5e6
f8=B#
Bxg6
exf1=N+
Kxe2
Q2b2
Nh8
Rxe6+
Qbh7+
Na5#
Qdb8
Q7b7
Nhf7
R5a2+
Qa1+
Nxd6#
Ncxd6#
R2a4
N5f3+
Qgd6
R7g6
Rgxg4
R1d4
Kh2
Rcxb6
N6xg7
Be8+
Kh1+
Rxe5#
Rdxg6+
Rbc5#
Qdxh5#
Nfe3+
dxc7+
N8f7
Rge7#
Nb2+
R7xe3
Nb4#
Qcxd1
R8h3+
Qeg4#
fxg3+
R7a3+
Rdxh6
N7xd6+
Qfc8#
Nfxg4
Bxf5
Qdg6+
Qhxd8
Qexf7+
Rcxd6
dxc8=Q#
Q1e3
Bxc1+
Bxc2
R6a4+
R3xc6+
Qdxe7#
Nhg4
Bxh6#
Bg8#
cxb8=R
Rbc7+
Rdxe3#
R7f5
R7xe5+
c7#
Qgb8+
Qda4#
Rhb1#
Rag7#
Qae1#
Ndc6+
dxe8=Q
Ncd1
Ref5
Rbg2+
N5xf6
gxf1=Q+
Rfg1
cxd1=R+
R3xh7
Rcf2
Nfxg2+
Rcxg1
Q5e8
Rac1
Bg1
Kh1
R6f2
Rbh6
Qcg4+
Nxf1#
R8xb7
Q2f5+
Q3xb4#
Nf4#
Nhg4+
R8g4#
Q8b4
Bb2+
Qd4
Nc7#
Qaf3#
Rgxd7+
Nab4+
R1e6+
R2xb3
Rab4
Rfh5+
N4xc3
Rdxc8
R3xf7+
R1d7#
Rfg3#
Raxb8+
Bc4
Qef7#
Ngh5
gxh1=Q+
Ncxb6
Qfd5#
Qh8+
exf1=B
Qdd2#
Q3c7
Rexb3+
Rf5
Nbd5+
Nxe4
Bcb4
Raxc1
Qfxd5
R8a4+
Rf4
R2e7+
R7a2+
Rdd1
R7c3#
N3xb5
Qxe1
Qh2#
Rhxe1+
R3xa2
Bhxf3
Q8g8#
Nxe7+
Raxf2+
axb1=B
Red8#
R1c6+
R4xf7+
Ncd8
Nbxc7+
N7d6
Qef7+
Qaxa6
Qxa8
Raf3+
Rhd7#
Rfb5
Rhxd3
bxa2
Rfxe4
R1a7+
N6xe4+
Q8f7+
N1xc3+
Qfh5
Re6#
Rc6#
N1e2+
Qh6#
Nexf7+
Rxc6#
Ndc2+
N3xf5+
Qcf4#
Ned5
Nd5#
bxc5
Nfg6
N1xb2
R1d3
Rbxf6+
Q5e6
Rxh4
Rbxg8
Nfg8+
h8=N#
Q5f7#
Rfxf5
Qcg2
Raxd6
exd2
Nc6
Raf7+
Nxf2
Rh5
Rhh6
Rcxe4
Q4a6#
R8f4#
Rxd6
Ngf2
Rca8
R5xe3
R1xe6+
Reh2+
Q1c2+
Qb1
gxf5#
Ndf3
Rdf1+
N2b4
Qfc3+
e1=Q#
Rbh4
Qgh6
Neg5
N1a2+
R3c4
R4g2+
Nfxe2
Qbb6+
Qac5
Rgxd5+
Nbc2#
Qgxg7+
a8=Q
Nbxd7+
Rcf5
Ndb2#
R2h3+
Q1xc3
Rhxf3+
Rcb8
Rcxg3+
Qhh7#
Rha1
Nba5
Qde8
Qdd1
N8xc7
Q1xe2+
R4xd5
R1c3+
Rgg2
Q2b7+
Qdh8+
R1d5+
Rhd1#
Qxc4
Qxa7
Rdxb3+
Nexc6
R3xf2+
Q3b7
Qcc5#
Nxg6
Rfxb6+
Rgb5
Ngxf1+
Nbd6+
Qxd8+
dxe5#
a5+
Bb8+
Qfxf6
Rexc8+
dxc5+
Rfxa6+
R6xa4
Qhe6+
Kb4+
Qxh4+
Qb5#
Qcxd4
Nxc4#
Q8d8+
Rgxc7
Q2f2+
Qbxf7+
Qec7#
Bxc8
Qdh8#
Rgb4+
Qdxe5
f5+
R6b7+
Rhxb3
Rcxa5+
Nce6#
Bc6
Rdxe1
Raxd4
R3c5
Nxa4
Rce2
Rgb4
Rda2
Qaxf8
Q7xh7#
Be6
Rgxa4
R3a2+
Nfxd1
N4xe6
Qxh2+
R8b4+
R1a3+
Nxf7+
Rxa7
N6xa5
Rhe8+
Qxc7#
e1=N
Rxh8
Rgxd1+
R6xg4+
fxg8=N+
R6xa7
Rbxa6
R1xb3+
N4xb3+
R8g2+
Q7e4
Nba5+
Qfe1
Ncb2
d1=R+
Kxd5+
Kxc4+
Rhxg3+
Neg7
Red1+
R7g3
Kxf6+
Rhxf5
Qd7+
N2xg3
Qhg5+
Ndxb5+
Qaa4
R4xf7
R8xh2
Qea2#
Nf3
N1g3+
Q8b6#
Qbxc6
Bc4#
Ne7+
Rfxa1
R4xe6
Qhh5
R1d2
Rbxg5+
Rxa4#
R2xa6
Qdb7#
Nbd4
...
Kxc5+
Nexc7
Qgc1+
R7b4
Ncxd3+
N8xh6
Rcf3+
bxa8=N
fxe8=R
Rxe6#
R5d3
Rbb7
Qaxa4#
Rcxd7
Rbxh5
fxe1=N
Rge8#
Rhxb2
Bxe5
Kxh6
Qdd6+
Q8c7
Rdb6#
Rge6
N1xe3
Qcc6#
Qxf7
R4g6
N6xb4
Kxe4+
Qfxc8+
Rde2
Q1h4+
Qbf2+
Rgxf3
Rf8+
axb6+
R2g7
R8g3+
Rgg6+
Rhg3
dxc8=R+
Qdxc3
O-O-O#
N4xb6
hxg2
Rdxe7#
Rxa5+
Qcxf6#
Nge6+
R6xf2
g4+
Q1a3
R4d3+
Q8xb7#
R7d5+
Rhf6+
Qhxg8#
Nxf7#
Rcxg8
N4b6
Ngf6
Nexd8
Rfxd3+
Q1f5#
Nxe6#
R4g7#
Nac3
Qab8+
Qfd8#
Qbb5+
Nexg5+
Qhxg5+
R4a2
Qgxg4+
Rbe1#
N5a3
R2xc3#
Qcxc3+
Qce5
Q5g1+
Nfxh5+
Qaxc8
d5
Rdxb3
Qaa6#
Q8a4
Qhxg2#
N4f6+
Nxe5
Q6f8
Rec4
Rxd1
Rcxc2+
Qfg7+
Qch7+
R7h6+
c6
Qfg7
Re8
Rxg1#
Q7e2+
Ndf7+
Ngxe3
Qcd1+
Rgxc4
Bc6#
R5g6+
Bxd8
Rgg3
Kxc3
Qdf6+
Rec7#
R1xb5
Q4xb4
Nfe1
R3b7
R7xc2+
N5b4
Qdb4+
Rhxh4+
R5g4
Rbxd1+
Rbxe5+
Rxc4#
Rdxe8#
R1f6#
R8xg2#
Ndf4+
Rcxc4+
Q6h5+
R2xh4
Qdc7+
Qhxf6
Q1d2
fxg5+
Rdf3
Rad5
b8=Q#
Qxe5
Qbxb5
cxd7
Rcxb1
N6xg5+
N4g6+
Rhg7#
R7b6+
Rexc4
Rag6
Rxd2#
Rexg4+
Ndb3
Bc3
a1=B+
Qexe1#
Q2g7+
dxe8=B
Qdc8
Nfd1
Q7c3+
R5xd6
Ncb7+
Rdxa5
Rexh5
N5c3
Qdb3
R6xb2
Qhh3
Qbg1#
e8=Q#
Rxf6#
Ndxe7
g1=Q+
Rdxc8#
Qed7
Rbf1+
gxh6+
Rea7
axb7+
R5xb3
Qhe2+
R4b3
Rhf8#
cxd4
Rcxa3+
Q8h6+
Rf2#
Bxe3+
exf3
Nxh8#
Rag1#
Bxd7#
N6d5+
Nh4+
N7xg5
N6a4
R8xb2+
Qa5
Kh3+
Rbxc1#
N1f2+
Qbe6#
N5xd3
Qaxc7
Nexd2+
Qa6+
Nfxg4+
Bxh7#
R3d6
Qff5+
Qfxb7
Qff4#
Rdg1
R5d3#
R7a6+
Bc8
N2xe3+
Rbd5#
Qhh3#
Qc2+
cxb7
Nbd3+
R5c7+
Qag8+
Qcc2#
Rxa5
R4xa2+
Rhc2
Rhxd8+
g8=N#
Qbe5+
Q8h4#
Nexc2
d8=N#
Q3g1#
Nbc4
R8c4
e4#
Rxc2
Bg6+
Nfd8
Qfb7#
Rbg3
h4+
gxh1=R
R7xh2
Qhd8
N5g6+
Qfa2#
R5d4
Qhh6#
bxa1=Q#
Rbxc7+
R3xh6+
R1xd3+
Rfc6+
R5f4#
N5g6
R8h5#
N8xb6
Kxc6+
Qgxe5+
Q8e8+
Q1c4+
Rfc7
Reh6
Nfh8
R3xc5+
Q6b2
dxc1=Q#
N5g4+
Qhg6+
N3e5+
Rbh2
Qhh8#
Rcb5+
Qexc2
gxh5
Rfb6
Q6d8
Rgxb2
Q8f6+
Nhxg6
R8c3
Qfxf2
e8=R
Rfc5+
Qexd3+
Raxd4#
Qdg5+
N6xd7
Q8e7+
b1=R#
Reg1#
Qxh8#
Qea2+
Rcf7
Rxf5#
Nfxg3+
Qbf3
N4e6
Qdh4
R1d6
Raxd7
Qxc5+
R8xa4
Raxg2+
Nac6+
R4d7#
Q4c6#
Rdxd3
Qhxe4+
Q3g4+
R5h7+
Qg2+
Rag8
Q7d3+
Red5+
Rc3
Rxb4
Rac5
Qxf2#
N6xc7
Nh1
a8=B
exf2
Nb5#
Rff8#
Rhf2
Ne6#
Qxh8+
Rxg8
Q5e4
hxg4
Rexg1
Rgxf2
Qec6
Ndf3+
Naxc8
Rexf1+
Ndb6
Ngh3
R8g2
Q1e3+
N6xd5+
N4d5+
R8h4
Rgf7+
N3xa4+
Qxe4#
Qdh6+
Bd1+
Qce1
R1h3
Rbxh7+
Qcxf5
Nf7
Rbd8+
Q2g1+
Qcxd6+
Q1g2+
Nxd5#
N8h7
Rbxg8+
Rgxe2
Rec1
Qexf6+
Qbxb3+
Qa8+
axb6
Qac5+
Qf3+
R1b7
R3d4+
Nbxd3
Qbd5+
Qae7#
Q7g4+
Rbxd1
Qdxd6#
Qb7+
Nxd3
Bg5#
Raa2
cxb3+
Qgb7+
R8xg3#
Ncxd4+
Qdb6+
R2e7
Rxh7
Rdxb6+
R6b7
Rhd2+
Qdf6
R2xg7+
Qdg1#
Nxa3#
Qxe2+
Qfxg3
Kxe5
Rgxg5+
Qbxd8
Ned2#
Bd7
Kg7
Rbg3#
Rfc8+
e1=N#
Kxg5+
R8a4
Rgxf8#
Rfxc8#
R3e4+
Qc1
Rfxh6
Rbf4+
Q3b5+
cxd1=Q#
R5xa7
e8=R#
Rexd2+
Rfxc6+
N1e3
Ndxe6
Raxh1
Ref2
R5xg3
Qdc6
Reg6+
Ngxf2+
Q4g4+
Nxc8+
Qba2+
R1xb3
Qcb1
Qcb3
Ba5#
Q8f7
N3xe4
Nc4
Rexe6
Rd8#
N6g4
Rab3+
Qhc1#
Q1b5#
N7c6+
cxb3#
Q2c2+
Rgg6
Qec8+
Qfd4+
R3xa4
Raxe3+
Kc6+
Kxe1+
Qbxb6+
Rh4
R1f6+
exf4#
bxc8=Q#
Q6b7
Q1d1#
R4g3#
Rcxf4+
Nxb1
N3xd4+
Rgxe5+
Rhxf8+
Be4
f2+
Rgh1
R7xc4+
Rxa3#
Rexg7+
Rfxa3
Bb3#
R6g2#
Qhxc2
R6d5+
gxf4+
h1=Q+
Qbxb8
R7d6+
Reh3
R7xe4+
d1=R#
Rfxe7
Qcb2+
Rgxa6
Nec8+
Rhxd1+
Rdxh3
N5h4
Rda8
Rfe4
Qdb6
Bb1#
Qhxe5+
Rbf8
Raxb1
R3h5+
bxc2
exf7+
hxg7
Bxa5+
Qe3
R8xe4
Rxd1#
R3c2+
g3
R2xe5
N3d2+
Rcg7#
Rhh4
N4b5
R8xf2+
Q7c4
Rxh5#
Qaf6
Qfe5+
Q5e7
cxd8=R+
Qcf8+
R2xb7
Rxg6
Rxh6
Qae2+
Kxd3+
Q4e3
Kxh1
R8e4+
R6xd3
R8f2+
Rcc7+
Bxf7+
Qbe8
Raxe7
Rexh3+
Qdf2#
Qba1
R6xg5
R4d7+
Ngxf3+
R1xc2
Q8xc5+
Qad1
Qb2+
Qcxe3+
R5xg2
Nfh2
Nbxa6+
Rde1+
Ndxe1
Ng8+
Qcd4#
Rhxe8+
Q1c5
Qgg3#
R6b7#
Rdxf2+
Nef7+
Be4#
Qaxg7+
Qxh7+
Ncxe7
Rhf2+
R4f3
Red3+
Qbb6
Ra4#
Nac3+
Rcxd8
Bf7
R1c4+
R2xa5+
Rexc3
Qbf2
Nab4#
Rfc1
N6xa5+
R8xf2
Q4d6+
N5g3
N6b7
Qfb8#
Q2c2
R1xg6
Nbxc3+
R7e6+
Q8a5
Qbe7#
Na1+
Bxd4+
Qhd1#
Rcxf8
R6d7
R6b3
R8xc7+
Qdh4+
Rhxh3#
Rcc4
Qgd1#
Qdg6#
N4xa5
Rec3
f1=Q#
Qxa6#
Kxe5+
Rhc2+
Nfxg8
Qge4#
Rbc5
Q7h6
gxf8=N+
Qba7+
Q1b6
N2d4
Qec7+
d8=N
Qaa2
N8xf6
Rhg5+
Raxf4
Rxf4
a1=R#
Rcd7+
Qcf1#
R1b7+
Rhe8
Rad4
Q4g5
Qdc3
N8d7+
Ndf2#
Rcf8+
N8d6
b1=Q#
Raxg2
Be8
Qbe3#
Kd6+
Qec2+
Qeg4
R7h2
R4b7
Nba2
b2+
Ree7
Qaa2+
Qbe4
N8xb6+
Qab2
gxf1=Q
Qbxc2
Rgd7+
Qcxg2#
Rgxg1+
N7h5
Nbc3
Qbc7
cxb8=N+
Rdxe3+
Nh5#
Qfh3+
Rcxc7#
h1=N+
Q8c4
Rxg5#
c5+
Qhxe5
Rgxa8
Ngh2+
h5
Rgxe4
Rbxd2
bxc1=R+
Qeb8#
Q1xa2+
Rgd7#
Rda4
R7xf5+
R8a2+
Rhxe5
R5d6
Ke6+
R8xg6+
Qbd3+
Ne5#
Rag2#
Rcxh7+
Rfxe6+
Ng4#
hxg6#
Qfxg7+
Rexc7
Rca2
Rhc8
Qhe3
Reg5+
Rdg4#
Qdf8
Q1h1+
Rfg7#
f6+
Rfa3
R7xd6+
N4xd6
Rfxf7#
Q4b5#
N2xf3+
R1d4#
N4xc6
Qge5
Qcc5+
Qdxd3#
Nfxg3
Qfh7+
Kd7+
R8c3+
Raxg6+
Bxf6#
R1xb6+
Nexd3
Qxg2#
Rhg5
N8xb7
Raxh3
Qge1+
N7xg6+
Kf6
Rxb8+
R1xa2+
Rag6#
Q6c5+
Bf5#
Bxf2#
Bxc1
Qgf3#
Re3+
R2xc4
Nxf4+
Na4
Qbc8#
Reg1+
N4xe5
R8e3#
Nfxh7
Q1c7
Qbg8#
R6h3
N5xa4
Qcd5#
Q6xe5
Nfd7
Qh6+
Ncd3
Bh4
cxb5#
Qeg5
Rbxc8+
Nfxe6
dxe8=N
Kxd1
Rgxf1#
Nxf6#
Ngf2#
Rgxh3
Nb4
R8xh7
Kxe1
Naxb2+
Q1xd1+
R2d3
Qcxd5
Qhe8#
Qed2+
Bxd6#
Rhe1
N4xh3+
Nxe3+
R6b4+
Nxa6#
Ndxe5
Qcg5
Qgxh7+
a1=Q#
Qgc4+
R5xb6+
R2d6+
Qba3
Q1xf2+
N6xh4
Q1e2+
Qexf5#
Q1e4+
Rxd8
Qbd4+
Qcd8+
R2h4+
Ndxe5+
Qgc8+
Rcg2
Qgxd2+
Kb2+
Ngxh5+
Ref1+
Q5h1+
Qgf8
Qexd8
R4xe3+
Rgxh8
Rbxg6+
Kxh2
N5b3
Re5
R6xe2
Nef5+
Rhxe7+
Ncxb7
Q1f5+
Qce8#
Q1a4#
Qxh3+
Rbxb7
Ba2
Rbxg3+
Qgf2
Q1e1#
Rbf7+
Qbxd4
Kh8
Raa3
bxa5
Qb5
Nfg8
Nef6+
Q4f7#
N3xd4
Qad7
Kc2#
R1h4
Qe8
Rfc2+
Raxb1#
Rbd1
Rgxe2+
Q5a3+
Qcf6#
Rdxa4
Qce6#
Nxe6+
R5g7
Qxc1
Rxf8+
Bxa8+
Neg3+
Nge4#
Rcg1+
d8=R#
R5b4+
Raxc7+
R1h7+
Kf2+
R2f6#
Q2d3+
Raxh5+
R4c6+
Qbb7
Rgd3
Qge3
Rxb6
R5b6#
Qce1#
Qhg8+
Nde7#
Qexg6
Qdh2#
Qbe3+
R4e6
Qfxh5+
N1a2
R8xa2
Qa7
N5a4
R5e7+
Qf2+
Nfd7#
Rbe1+
N4g5
Q8xe7+
Bxg2#
Qda1#
Raxg8
Rhd8+
R4c2+
a5#
Qhf6+
Q5d3
Rxe3
N8c7+
Qexf2+
Qgxe1#
Qcxd6
Q8xb3
Q2g2
Qdxc1
Qfa6
Nexd2
Nxf3
dxc8=Q+
Raxa1
Rf3+
Rcb7+
R1g7
R4xd5+
Rfc3+
N2a3
Qaxa2+
Qb4#
Rfe8#
Ngf5
Bxd2#
Rhf3
R7f2+
Rb4
Ndxc6+
Nbc5
Rbe8+
Rfxf8+
Rdb5+
Q1xd5
Rxa2+
Qfe3+
Q4f6#
R1xe4+
d5#
Ngh3+
Qeb2+
Rxa8+
Rbh8
Qbxd7+
Rcf4+
R3h7
R3d2+
Ng5#
Rxd6#
Qgf2+
Rfxg3+
Rd4#
Q1d6
Q2d6
N4xb5
Qgd5+
Rhxh3
Nfd5+
Reh4
R8e5#
Ncd4#
Bxb5
Qg1+
Rhc3
N5xh4+
Rgh7
Nec1
N5xa6+
Bd1
Rbxd6
N6e5+
Rga4
Rb1#
Q3f4
Rxd4#
Nxg4+
Qexd5
Rxa6#
Qac6#
R6g7#
Nxg5#
Naxb5
R2xf5+
Qfa6#
Raxb6+
Rb2#
Qfg6#
Rhxg4
Rfxf2+
Q4b7+
Rhxc5+
Qee4#
Qff3+
Rcd7#
Qgxg4
Ngxf4
Rfxb3
Na8
R8xa7
cxb1=N
R5f6+
Qf5
cxd6+
Qee5+
Qfc8
axb1=N
Bxb4#
Nfxd4+
Q8b4#
Bc2
Rgxg2
Nhxf2
Qxd3+
Rfb4
Rgxf6
N6xe7
Q1e2
Nab5
Qfd3+
Kh4#
Rgxa2+
Q3e3+
Ndf7
R4xf6+
R5xc4+
Rfd8+
N3a2+
Ncb5+
fxe6+
Kxb7+
Qce7+
Bxc7
Qdxf4#
Kxb1
Rbg5+
bxa6+
Nhxf8
Rfxg5+
Rexh7+
Bfc4
f4+
Qdxf2+
Qf8+
Q1d1+
Qexg5
Q4e5+
Kxd3
Qf1#
Rec1#
Q8d7
Rcg4+
Rexc1+
Qhxf2#
Rdxh2#
Nfg3+
Qdd7
Bxb3
Nxg3#
R7xf3
Rbb3
R7b2
b7+
R1xf3
Rfxd7+
Qba5+
Q2d7+
R4xh6
Qbxf1+
Qxh4
Rec6+
Bab2
Bg4#
R2xb3+
N5xc6+
Qcg3#
Raxb8
R5g3
Rbxg7
Qhh4#
Q6c8
Qhc7
hxg1=B+
Qce7
Qxg4+
Nfe6+
R5xb2
Nef7
Q1b2
Qaxe1+
Q7g4
Rxe5+
R1xe7
R8e6#
Qcf7
R8g3
Qcxc7+
R6xb7
Bxc3+
Raf3
cxd8=N+
Qhd5+
Rxa2
Q6f5
R5xf2+
Rbd1#
Qaxa4
Rdh7
R3b2#
Qf8#
Qaxd6+
Nhf5
Nba1
Nexg1
Q7xb7#
Rhxg1+
Rbe5#
Raxa2
R1xa5+
Qbd2#
Qeh4#
Bh4+
Qce4+
Rfe2
R3f6#
fxe3
Qgg5#
Rah3
Rcxb6+
N3xf4
Q8h8+
Bbc5#
Rbb8
Rf7
Rfg2
Rfg3+
Rxe4#
Ngf5#
Q2g8
Rfh6
Q8e4
axb5+
Kg6+
Qxf1#
Bf3#
R3c2
Qcxg3+
Qdxg5
Qef6
Nc8#
Reh4+
Q4f3+
Qab7
h8=R
Ndb7+
Rff2+
Q4h6#
Qec1
b3+
Ndc3+
Q3f2
R4xa3
Raxc4
Rbg8+
Qexd4#
Rad7#
Qhxh3#
Ncxd3
Rxd7+
R7xb6+
Rhxf2+
Rcxf6+
N1c2
R5d4+
R4b6
N3xe2
Rcc2
Qae7+
Qaxc5
Qff7#
Nxa6
Nbc1
Qa4#
Ngh2#
Bxe1+
Nxd2+
Qaf3+
Qc5+
Ne4
Qfg4#
Rhb7#
Nxg1#
R3f6+
R6xe7
a2
Rfe3+
Nxe1
Qe1+
Rfxg5
R2xd4
N7d6+
Ngxe2+
Nxe8+
Ndxc1
Raxh4+
R7h4+
Rexg2+
Nfg6#
dxe8=Q+
Qcc3
Rhxa5
Rdxh4+
Qdg8
Qdh6#
Bg1+
Ndc3
Rfxg3
Qge2+
Ref4#
Rbxh2#
Ke5
Nbd8
Ngxe5+
cxb1=Q
Q8a7+
Rcf7#
Rhxb4+
N6xb5
Raf2
Qexf2
Rbf3
Rgxg3
Rhxf2
Rbxh8
Qxh8
exf5
Q2e3
Rdg7
Rdc8+
Nexg8
Qhxh3
Rbg3+
Bxc5#
N7xe6
d3
R6g2
Qfc4+
Rae8
Qae1+
Q8d7+
Q6d7
Qxe8+
Qae5+
dxc6
Kc2+
Rxc8+
R3f2
Rfxg8#
Qhxe1#
Nef3
Nxa8
Ndc8+
Qbxg2+
Naxb3+
Rhb6
Rh5+
Bxh3+
Qexe6
Rgd2#
Nxb1+
gxf3+
Ncxe6+
Qfxc2
Bxa4+
Rhxc7+
Q2g4
N7xc6+
Nce4
Rxg7
N7a5
R7h5+
R3xa6
Rfxb7
Rfxd1
N6e4+
Rxg1+
Rexc5
Bb4+
dxe8=R+
Rcxh3+
Qhxb2
Qxe7
Qhg8#
h6+
Rfb8
Qcc3+
Ndxf5+
N1xf3
Nexg6
Raxe1
Qhc2
Nxe8#
Qgb2+
R8xc4
Ndf4#
Raxa2#
N2xc4+
Ned1
R1b5+
N6d5
R2c6#
R5f6
R7d4+
Qgd1+
Qfd2#
Raf1
Qbg6
b8=Q+
Bc8#
Rgxb6
Bf6#
R6xg2
Q3f6+
N2xf4
Q1c3
Q5g5+
f1=Q
R8f5+
Qxa8#
Rxb8
h1=B+
R6xd3+
Rhxh7
Bfa3
c8=B+
Qdf5
Ng7#
Qcb8+
Qhf1
Qfxf2+
Rgxc2+
N5xc4+
N6f7
Qge1#
N8d7
Rff8+
Qca4#
Ngxh2+
R5b7+
R8a3#
Nd8
Qxb6
Rexa4+
Rfxh1
Qah1+
d4+
Qexe7+
R7g3#
Bxd7
Qec6+
Qha8
Bxf4
R8xd7
Rxc1#
R5xe6
Qcg4
R8xd6
R2xh7+
N2xd3
Ncb5
Qxa4
Qhxe7#
N1g3#
Re4#
Rcd2
N6xc4
R6a2
Qab6+
d6
Bg8+
R7d4
Qhh8+
Qcd4
R1xe2
Rbf5
exd1=Q#
Kxh3
N4f5+
Qgxg6#
Rhg8+
N8d6+
Qxe4+
c8=B
Bd5#
Qbd3
Rgxd7
R8xd4
Rfb1#
Qgxe3+
R4b2#
Raf6
Q5g1#
R3xe2+
R5d2#
Qfxg6+
R7xg3+
R7xd4+
Rbd7
Nfg2+
Ngxf1
Qdxe6#
N4e5+
Rce2+
Rch1
Reb5+
Rg4#
Bxa4#
Q1g3
Rgd2
R7xg4+
d8=Q+
bxa8=Q+
Qhd6
Rca4
Ndxc7
Bxg4+
Qxd5+
R3xd4
Nhxf3
N4xe3
Rcd6+
Bf3+
Ngxf8
Nfxd2+
Qef5+
Rexf2
R3xd6+
Rcxb5
Qaa1#
Raxc2+
R2xg6+
Rexg2#
R1xc4
Q2xf2#
Rfxg6
Nd3
Rcc6
Ra1#
Nfxe3+
Ngxh7+
Kf8
Qha1+
Rgxd2
Rxb7+
Q7d6+
Qgf3+
Neg6+
N5g4
Bxb8
R8d3#
Rgf8+
5
Nhxf3#
Q8e6#
bxc1=R
N4a3
R1f7
Qeb2#
Qfh4#
N1a3+
Ncxa7+
R2xf4+
d5+
R1h2+
Qge7#
dxc8=N+
R8xg7
R5xg7
Nde7
dxe2+
Rdf3+
R5a2
Bc1
Kb1+
Qbxh3+
fxg1=Q#
Rfh2+
R2e4
R7xa5
Rd5
Kc8+
R1g6#
R2xg6
Qeh6#
Nfd4+
Rgxc4+
Rcd1+
Rcxc3+
Rh1
N3c4+
dxe8=N#
Rff7
Qgf8#
Qgf5
Qgf1+
dxe7
Nxb5+
Ref4+
Ndb3+
R4f2#
Qdxd6+
Rdc5
Qah1#
Rexf7+
N7xd6
Qbxb2#
Qf3
Rgxg4+
Qaxd8#
Qcc8
R8e4
Nfxg7+
Kxf3
Nca8
Qbg8
hxg1=Q
Nd4+
Qa7+
Nhf7+
exd7+
Qxf5#
Qfd7
Nfh6+
Nbxa2+
Q3e1
R5g4#
N3xd2
Rdxc3
Ngxf7+
N6g5+
Rcxg7+
Kh4+
Q8a5#
Rexf1
Nhxf6
R6b3+
Rgxa1
N6xd4+
Qca6#
Kc5
R4b6+
Qeg8#
N4b3
N6e4
Rae7#
Q1xg3+
Ndb1
Ref2+
hxg8=N#
R1b6#
Ke2
Nec2+
Rxg6#
Rg4
R1c5#
Rch5
Rhc7
R4b2+
Rdxb4+
Qda6#
Qhf5
Rg3+
Rag8+
Nfxe1
Kc2
R1a6
Rgxg6+
Qcf8
N1d3
R1h6#
Bd8+
R3xg7
Qcxh2#
Reb1+
Qea1+
Rxe6
R6xf3
Nxc4+
R5f3
R8xf6
R6g3+
Qgd5
Rac6#
Qcxb2+
Qdf7#
Rgd8+
R7xf4
Rdg2
R5c4+
Ncxa8
R4f2+
Rbxe1+
gxf8=R+
Kxb2+
Qfa3+
hxg2#
Q4h4
Q3b4+
Kb3
Nhf1
R6d7#
Qe2
Nh1+
Rfxf5#
Qef3#
Rhxa7+
Qad2#
R7xa6+
fxe8=N+
R8xc6
Nfd6
Rfxe5+
N3xh4+
Qfxd7+
Nxe8
Rexd8
Qxe5#
Nf8
Bg7#
Rdxf6
Qg8
Rbf2+
axb1=Q#
Rab1+
Nfxd5+
Rcxg1#
Qxf4+
Na2#
Nd2#
Q4d5
Rhg1+
R4xe5+
Bxd4
Q4g5+
Qbf3#
Qaf2#
Rdxc5+
R2xe6+
Nhg3+
Rcxh8
Rcf1+
Q6c7
Q8c8+
N8f7+
Nxc7+
Qab5+
Rfh1
Qec8#
Qfg3#
e1=R#
Qfxf5+
Rhxc7#
f8=Q
N7c5
Qgxg6
Nxg2
d2+
R1b3
Raxd5+
Nexg4
R4xg3+
Q3c4+
Nf2+
R5xb4
Ka6
Rcb3
R6xh7
Qbd8
Qxh4#
N1xd3
Rf3#
Rde7+
Nxe5+
Nfh7+
Nxe6
c8=B#
Q8b3+
N1xd2
Rhxd8
Q8c7#
R4xa6
R2h6
Rfd4
Qe4
Nef4+
Q3e4+
Rgxe6
Nbxc1
Qed7#
g1=R+
Qca2#
R8h3#
Q6d6+
Qdxc2
Qxf8+
R6xh5
Qgxf8+
Kg8
Rd1#
R7xg3
Q1b2+
Ngxe1
N4g3+
Qaxc3#
Bxb1
R1a7#
Qgb1#
N1d3+
Nxd5+
N6f5+
Raxh6
R1xg4
R2xe7+
Bh1
Rb3
Nfe2
Rge7+
R2c5
Ncd5
Rd3
Nbd5#
Nac7+
Rgc3
R3g4+
a7
Rexb3
Rh1#
Qgf4
Rcxe5
Rhg8
Qcxg6
Rgd7
Rcxb7+
Qga3+
Rfxd2+
Qbg3#
Q2xc2+
Qhb1+
exd4+
c8=Q+
Qcxc2
dxc1=R+
Nfxe4+
Bxf7
N5xg4+
Qcxe8
Rfd4#
Q3xf3
R3b5+
Q5d5
Rxe8
d8=B
Kxd4+
Rexe3+
Nhxg2+
Qhxc8+
Q7e4+
Qfxb6+
R6xg7
Rec4+
Rgxb3
Rhxe4+
gxf8=R
Qfe3
Bxg4#
Reb8+
Nhf8
R7xc6
R5d2
R1xd7
Rgxg2+
Raxg3+
R2xf3
Naxc5
R8xb4
g8=B
Rhxb7
Qh2+
R6xf4
Nfd7+
Kxg2
Q1xe1#
Rcg3#
Kxe7
Qfe1+
Qad4#
Nxf8#
R5xe2+
R8e3+
Nge5#
Rhe8#
Rexe6+
Rgc4
Rd4
Qgd4+
N5e4+
Nxa4+
Q2e3+
Qce4
Qxa2
N2e4
R2xd6+
Qdc5+
Rxg7+
Q5f1+
Kxc1+
R8c6
Rgxg1#
R2a7
Rhxe1
R8xh3+
Rec7
Qxg7#
Nc3
Reg3+
Rcxg2
Be5+
Qaxb5+
Ree5+
Qbxb3#
gxf5+
Kxa7
h8=N+
R6f4
Qxb4+
Qexe5
Rexd8#
Rch2
Q3f3+
Nhg7
Qbe7
Rf5+
Q5xc6
Nbd2
Qxd7
Rcxb7
Q5d7+
h1=B
Ngxh6
Rh3+
Qdxf7+
Nexc7+
Rexc5+
Qcd6#
Raxc8+
Qhe8
Rexd2#
e8=N#
N5xh4
Qaa5+
Nexf6+
N7f6+
Rcxe6+
R3xb7
Qhe5+
Nef2+
fxe2
Ne4#
N4xd5+
Rce7
Nce2+
N3a2
hxg8=B+
N5f4
Q3h7+
Raxb6
R6b5
N6e7
f8=Q#
R6c5
fxg1=R#
Qbd5#
Qgxg2+
Ncxb2
Rhxa6
R7f3#
Rfxd6
Raa6
Qaxc2+
Rdxf8
Rhxb5
Rcd4+
Nexg2+
Nca4
R1xf5
Kh5+
Qhxg5
R3xa7
d8=B+
Q3g3#
Qg3
N2h3
Qad8#
Rd4+
Rfxe2+
Rhxa4
Nfxh3+
Nxc5
bxc1=N#
Qbxa7+
N4d3+
Nexc8
R8xa4+
R3a5+
Qxb4
N1f3+
R1a5#
Qcb8
Rexg3
Qdxd7#
Rfxa2
Rdxf7+
R8b2+
Q5h5#
e1=Q+
Qbxe5
Qhe4+
bxa6
R4xb5
Nce2#
Qed6
Qga5#
Qef4
R8xd5
Qxa7#
Q1a7
Ncd4+
Bge6
Qfb3#
Bxa7+
R7g3+
exd7
Rf1
Qgf7+
Qdd1+
Rfxf1+
R6g3
Rfe4+
Nba3+
bxa1=B
Qdg6
Kxg1
Nxd2
Rbc2#
Rbxg1+
Rgb3+
Qce5#
Q3d4+
N7f5
N7c5+
Q4xg4
Qed8+
Nec4
h8=B
Ra6
Rad6+
R5xc2
R6xa5
Nxd6+
Nhxg5
Qbxe2#
Qhd8#
bxa1=Q+
axb7#
Rfe5#
R6xe3
Qaxe6+
Ndb2
Rdxf5+
Nfxe8
Bxf3#
N3g2
Qxh6
Qcxg6+
R3xc6
hxg1=R
Qfh8#
Q3d6+
Bxd2+
Qaxd8
R8h4#
R2d6
R2xc3
Rfxg7+
Qxc3#
Rhxg7+
Rxh3#
Qexe6#
Nbxd8
Qcxf4
Rg6+
N3h4
Rcxb1#
Q2b5+
N3xc4
R5h6+
Q6xe6#
Nfd8+
R8f4
Bd5
N5xd4+
Nfh4
Rhxf1+
N5xb4+
Rcd4
Qdd5#
Rab8
Rcg1#
Bxa2
Rfxd5+
Rcd8#
Q8e5
Qeb7+
R7b3+
Rde2#
Rcxa8
R8xf3
Rdxh5
Rxh5+
Qhd5#
Rcf6+
R1c3
Bxg8+
R2xc6
Bxc6
R8f6
Rdb7#
Qac3#
N2xa4
Kf5
R1h6
Qdxf3#
Rce2#
R3g5+
Rhxh5+
Qgb3+
R7e2
Rc2+
c2
Nfxe5+
Kc5+
Qga7+
Ngxh3
exd1=R
Nfh5
Rfxh7
Qcd5+
Bf4+
Qha1
Q2e4
R1d6#
f1=R+
Qdc1#
Qhxb7
Q1d4+
R3e5+
Qxc2#
R4xc2
Nfxe4
Rca3
R3b2
R6xf2+
R8xg5
Qfxg2+
R2xh7
R2a7#
R6g4+
Rdxe6
Qg5
Nbxc1+
Rg3
Q3e5#
Rfxf1
Qdxc4
R6xc5
Q5xe5
Rdxf7
Qfd5+
Rfxc3
Bxh4
R5xd4
Rbxd4
Qgxd2
Ngxh7
N4d3
R6xd7
Qge3#
Q2d3
dxc8=R
R5xe3+
Kb6+
Kxc8+
Rbxd1#
R8xa5
Qhe7
Rexc8#
Ncxb8
Nexf2
N5xc6
R7e3
Rexe8#
Rxe4+
d1=B#
Q1f3+
Qec1+
Rde6+
Rcxf1#
R3d2
Qca3
Rbxb4
R2b4+
Rdg2#
e1=B#
R6c3+
R1xh2+
Rh3
gxh8=Q
Q8f6
Nxd5
R3xh4
Kxd1+
Ndb5+
Nab5+
R2h6+
Qad5#
R3b6+
R1f5#
N3xd5+
Rxc5+
Ndf3#
R1xh3
Rdxb2
Rhxg6
bxc3
Rbxh7
Qec5#
N1e2
Rdxa1
R1xc7+
Rbf3+
Q5e5
Q8d4+
Rcb5
Nbc8+
Q3b3
Qec5
Qfb1+
Qee3
Ndxb3
R3xa2+
Nbd8+
Qaa1+
Ncxb3
Bxb6
Qae6
Qdd3
Qh4+
Bcd7+
bxa3+
Q5b5
dxc3#
Qc7#
R7xa2
Rdg8
h1=N
Ng8
Rxg5+
Kf6+
Nfg1
R5xf7
R8xb5+
Rbxa6+
Nc1
Kxb3+
Q1g2#
R1d5
Nc5+
Rb1+
Rhg2#
Rhf7
Rcxb8
Bxe5#
Nfg1+
Rcxg4+
Ngxe4
Nxc1+
Qd3#
hxg8=Q
N3xg4+
Qgxf2+
Rexe5
Rg2#
Qae8
Q3xg2
Qgd2#
Q6b7#
Rdxe7+
Qde5
R2xc5
Q7g1+
R8c6+
Q1xg1#
gxf8=Q#
R8xb3+
Q5g3#
R5xe4
R5xf2
Nc6+
Nc2+
Ndf6
Qdh7+
N6b4+
Rbxe8+
R4c3
Qa2+
cxb2+
Re4+
N6a5+
Nec6
Qcc4
Nxa7#
Qeg8+
N1f3
Rexf8#
Q6d5+
Bxb2
Ka3
Nca6+
Qde3+
fxe6
Rc4+
Raa1
Qbe8#
Rgc1
N7g5+
R3xg6+
R6c2
Qbb4#
Rdxc1#
Rcxe1#
Qhf3+
Q7c2+
Kxe7+
R2xe6
Nxc8
Reg4
Qaxb2+
dxc2
Nxd6
Qdxg5#
Raxb7
Qgxc1+
Kd1
Rxd5+
hxg6
Rhxg4+
Rcxf1+
R2xb4
Rce7#
Q2xd5
Rhxf8
Qcg7+
R8xe3+
Ka7
Qaf7
h8=Q#
R8xg2+
Nbc2
Re2
Qeg2
Nxg1+
gxf1=B+
N3xg5+
Q4b3
Ncd2
Ncxe2+
Qhh7+
R2xe5+
Q7g7
Qgd8
R5xg4
Rae2
Qbf1#
Q1d5+
R1f3
Nfh3+
Qe7+
Rhd3
N2f3+
Raxb4
N4f5
N3f5#
Rea1
Rexg7
Qhf8#
R1f4#
g4
Rxe7+
Nxb7+
R5e3+
Qgg5
Qfxh6+
R3f2+
exd8=N
R3xd2
R3c7#
Rdxd4
R8xa7+
R5h2#
Qea5+
Nge8
R7g2+
Rxf5
Raxd4+
Rhb4
Qxe3+
Qxh6+
Qfxb8+
R6xe4+
Rxa3+
R4e5+
Qad3+
Rga8
Q6c5
Qcd7#
Q5d5+
Kg8+
Qgxd5+
Qa3+
Qaf2
Qbd6+
Bc3#
Rdg5+
R5xf4+
R6f3+
Rxf1+
Rfxh4
N7b5+
N3f2+
Nfxg1
N1f2
Q3b2
Q6e7+
R6g7+
Nxg4
exd1=Q
Nce5#
Rgc8
Qcxb4#
Q8a7
Kxg8
Rgxd8
Rxe3#
Rhxh4
Raa4
Qdxb6
Qch3
Rcxe8#
Qed3#
R4xg2+
Qbf8
cxd1=N+
Rfxa8
Nde2
Rexd8+
R8d4
Qbg1+
R4e3#
Bxe7+
Rbg2
Qhc3+
R6d7+
Rexf8+
Rexf1#
cxd6
Rbd3+
Qbb3#
Ngxh7#
Qgg7+
R6h7#
Ke5+
Ncd4
Qhe4#
R1e5
Rac2#
Ngh4
Rca7
Qbc6
Bh7+
R2c4+
N3b2
N7xa5
Qff5
R1h5#
Rhxg1#
b1=R+
Qhxe6+
Rcxe3+
Ne3
Qhh8
R4g7
Rxb8#
R4e7+
Q3xh6#
R8xa5+
hxg1=R+
Bxa1
R5e4+
cxd8=Q#
Qed2
R8b7
Rhd7
Rexb6
Rxf8#
N8a7
R7xa4
Rd7#
R2a5+
Be1
Qfd6#
R2c3
Nexf2#
Neg2#
Qcc6+
Rdxf6+
Rcxg6
Qbxb7
N8xh7
Rxa7#
Rbh1
N7e5
Q8xd5
Bd2
Bxd2
Rexe1#
cxd8=Q+
exd8=B+
Rdb2#
axb1=Q
a3
Q5f3+
Rgxc8
Qde1#
R5f4+
Nexg5
Bxd3
Ngh4+
Ra8
Rdxb7+
R1xf2
Rfa6
R4xe7
Rbb5
Raxa6
R2g7+
Qxg2
Qef8#
Rg5
Rhxf4+
bxc1=N+
Qaxc4
Rcxe8+
Qac1
Qbxh5#
Qdxd1+
Bxg3+
Rhxh3+
Qae2#
Qdxc7#
Qe3#
e5#
Qaf8
Rexh4+
Qxg4
Rae8#
Rcb5#
Rexc6+
Rgf1+
Rdg6+
R4h5
Rge2
bxa1=R
Rexb4
Be3
Qde2#
bxa1=N+
cxd8=B
Rcxb5+
Nac2
Rae2+
Nec5+
Q6f8+
R1f6
Nab4
g8=N+
N4xf6
Na5+
Ndf8
Rgf1#
Nf8#
Bc4+
R1a2+
Rdxg5
Rfxc1+
Qef4#
Qaxd5+
Rbxb5+
Qce2+
N8xe6
Qxh7
Nhxg7+
Nxf8+
Nac8
R8g4+
Nfxh6+
R7xf4+
R2c6+
R6e2#
hxg3
R5xf6+
Qea3+
Nca7+
Re4
R3xb5+
R6xf4+
Ncxe6
Nxh6#
Rgxh2+
R6d4+
Qdg7
Ndxf6
Rhxf7
Rdxe4
Rae8+
Q8c7+
Qfb2+
Rda3
Ba5+
Q1xf4+
Nfxd8
R8c7+
Rxf3+
Qdg5#
g1=B
Ke3#
Qdxd4
R3d5
Naxc5+
Q8c2+
R2a3
Rgd8
Q7c5+
Rxg8#
Nde8
Ncd7
R3h2
Rb6#
R7xc5
d8=B#
Rad3
Qxa2+
Rhg6
R4e6+
Nef7#
Qha7
dxe1=R#
Rf6#
cxd8=N
R5xh3+
Qfxg2#
Qge4
Nfe6#
Qxg5+
Rexb7+
Qed4#
N3xa2
Rfxg8
Rfe8+
Bh4#
Qdc1
Qgc4#
Rdd6+
g1=N+
Q7xc5
Na2
a8=N#
Nf3#
Q6f7+
Rexc2+
Rexe1+
R1g3
Ke3
Rdxd2
Qdb1#
Na6
Rcxe2+
Qxf1+
Qbxd5
N8xd6+
Qd1
R1xh6+
Qd2#
Rbg7+
Rge5+
Rbf3#
N1g3
Rgb1+
Qgf4+
Qh5+
Ncd2+
R2d4
Bxe8
Ngf7
Qc8+
Bxa4
R1c4
R2e4+
Nfxg5+
Nba6+
Qxe6
Nfh4+
g1=N
Kc4+
Rxe2+
Qxe3
gxf6#
Qdg4+
Rhxh2
R3xb6
Ncxd1+
Rgd4+
Qaxf2+
Qcf2+
Rad7
Qdh2+
Qcxb2#
Qfe5
dxe1=Q+
Qhd1+
Qhxh4+
Ne8+
Qxe3#
Qdf3+
Q6b5+
Q8xc7+
Rdb7+
Rgxf7+
Qxh3#
Qhb2
Rcxd7+
Ncd7+
Rad1
R2f4
Ndb6#
Rgxe4#
f8=N#
Rhb5+
Reb7+
bxc8=B
R8f4+
e1=R
Rxh4+
Qbe5#
Kd3
N6f5
Q8h7
Bxc4#
Rgxd6
Be1#
Qeg2#
Ref7
fxe1=R
Rae1
Rcf3
R7b5
Q8xe7#
Rhxa2+
Qbh7#
R2g4+
R3f5#
N2g4+
R3xh4+
Qcc7
Rhxc6+
Qf5#
Kf4
Qcf7+
N2xc3+
Qdxe4
Qdxd2
R6f3
R8c4#
Nxc2#
Nfe7
Qe1
N3h2
Ned2+
e6#
Qaxa5#
Qge2
Rea6
Reh2
Rgb7+
Qah3#
R2e5+
Q5f2
Rcxh2
Qdb4#
Qgf5+
Rgd5
Bd5+
Ke3+
Kxg3+
Qxc6#
Qgxf8
Ke7#
Qae6+
d6+
Qee7+
R8c3#
Qexc6+
R7e5
Rxf7
Nexf5
Rbxg1
gxf7
Rxc8#
Nhf2+
O-O-O+
Qhxg7
h6#
N3e2
Nb4+
Qh1
Rfe7
Qxc8+
Rexf3
Rgxc3+
Rgxg5
Rexf3+
Rbg1#
Q5b5#
Q8b2
Rhxb7+
Qgc2+
R3e5
Rda7
Qca2
Nxa8+
Qaxb1
O-O
R8g5+
Rad2+
R8c5#
Qhxb7+
Qca7#
Qhc6#
Rfd8
Nfd2
dxc1=Q
Rfxc2
Qgh7+
R5c3
Rxh1+
Rec2#
Rg1#
Nf4
Reb8#
Qcxf8#
R2xc7
Nbxd4
Rf7#
Q5a1
dxe1=Q#
Qde4+
Na7+
Qdxc5+
N3c2
Qee3+
Rexh5+
Qcxa4
Qbg3+
Qcc2
R3a7#
Nbxa6
Qad4
Qhh1
R3xe6
Red6
Qhb8+
R8h7
Qdg4#
Ref5#
Qa1
Bd7#
Bf2#
Qa1#
Be7
Ngh1
Rhd2
R4xd6+
R7xe3+
Qce3
Bg2+
c8=R#
R4b5
R6xa7+
N5a6+
Rag5+
Qeb6#
Nac7
R1c7#
Qxf5
Rxe7#
Raxe4+
R3h6
Kd3+
R4d2#
Q5d4
R7c4#
Ncxd8
Nhxf7+
R2h4
Qfb8
Q1xc3+
R6b4
Bxg6#
Rd8
Qga4#
N2xd4+
Bh8
Qgxb4+
gxf8=Q+
Ncd6+
Qbc2#
Ndc1+
Nxb8
R6xf7+
Ndxc2
Neg4
Nc6#
R8d5+
Qff6+
R2xf5
Ke2#
Rch4
R4a6
Rfxe6
Rcxh5
Rde1
Raxf3
Rfc8
cxb4+
Nexc2+
Nhf1+
Rfxg7#
cxd5
R2c5#
Qga1
h8=R#
R1b2+
Kxb8+
N8b6+
R2g6+
Qhb2#
R8g7
Qaf1+
Red2
Qd1#
Rfxg1
Nbd3
Qhxg2+
N6c7
Q4g8+
Nc5
Qfxf3
Qc4+
Ngxe7
Nde3+
Q1e1+
Bxf7#
Rdxh6+
b7
Be2#
Q6d6
Rfxe1+
Rfg5#
Rgc6+
Qbh2+
R5f2
R1c7+
Qxc8
Qfe4#
Qaxd7
Rhxc8
Qce3#
Qexb6+
Rdxb5
Ng2+
dxe6
Raxc4+
Qae2
Rfxg1+
Rdg1+
Nexf1
Q5xf7
Rexe7
Rgxb7+
R5c6#
Rfxe7+
R7xa6
Bb7
Kxa4
Red8+
Ka3+
Ngf3+
Rga6
Q8c5
N3xg2
Raxf3+
Ncb4+
c1=B+
Nef4#
Rdd8
Qcd7
Qbb2+
Qac7
R2h5+
Qdf2+
N2f4+
Nbxc5+
Rbxd2+
Rhg1
Nbxd8+
N5xf6+
Q3d2
gxh8=R#
Nef6
R7xc6+
Q5a3#
N6xh5+
e6+
R6a3+
Raxe5
Qgb1
Nbd1+
Qbxc6+
R4d6#
Qdf7+
Q8e5+
Kf7+
Qc8
Qcxa6+
Reg7#
Rhe6#
R8a5
Ndc7+
R3c6
h7#
Kb8
Qbg8+
gxh5#
Rbxb5
a7+
R8e2
R1e4+
Qdxf5+
R1xd3
R3xe5+
Rbxb2+
Q7a5+
Qge6
Rcxa2
Raxh4
Ncxd2+
Rge7
R5b6
Ba7#
Kxc7
Nab1
a5
R4h2
Qae4
a2+
Qxe8
b4
Rbe2
Kxf7+
Qfh1#
R3xf6+
Qfc2#
Bg5+
Kxh5
Q1a1#
N6xe4
Q5a2#
Nhxg5+
Rhxh1
Q6xg6
Raxa3+
Qfc1
Q2b2+
Q3e5
Qeb5#
Rdc8
Rbxc6
Kxe4
Qbf4#
Rfxg3#
Nfe5#
Re5+
Ncxd4
Rac8+
Nexf4+
R8xd2
f3
Qad4+
Qdxb8#
Nxh2#
g6#
N4h5
Re7#
Nexf8+
Qxc8#
R7e6
Ba6#
Bg8
Bxh5#
Qgh1+
Kxb8
Qdxa4+
bxa8=B
Rfb2
c6+
Q1a7+
Rgxg7
Rdxf3
R3xf5+
Rcxa2#
R3d2#
cxd2+
exf8=Q+
Qae7
Rdxd2#
Bxb4
R7e3+
Rha3
Rb3#
Q1f3#
Qh8
Nef4
Qdc2+
R7xb3+
Ndxb6+
R5h4+
Qxf3+
cxd4#
Bf6+
Q1xe4
Q1f3
Qxg3+
fxe7+
Qdxe7+
hxg3+
Qdd4
Q8a8
Qgc8#
Rf2
R5c6
R3h4#
dxe8=N+
Ncd1+
Q5e5#
R1xe6
R2c7+
Qfd3
Qcxg5
Qd7#
fxg6
h8=R+
R8f3+
Rbxc6+
Bf5
Nexd7+
Qhg3#
Ncb4
Rb5+
Bxe5+
Rxd5#
Nexg7+
Qfc1+
R4xc6
R2g7#
dxc8=N
Rxh2#
Rdg3#
R8xf7
Nde3
Rgc5+
Q7f3
fxe8=Q+
R3xb2
Rhf4+
Qexd5#
Qexb7
Ref2#
Qxc3
Nh1#
R6f7#
Rbd2
N3e5
Rgc2#
Qee8+
Reb6
Rag4+
R1xh3+
Q5e4#
e2#
R4a6+
Rgxc8+
Rbxe3
Rab5+
Rad1+
Q2g2+
Ng3#
Ncxd5
R4f5+
Q8a3
Bxc8+
Qxc2
R3xf4
Na1
Qdxf3
Q7b7+
N2xb3
Qdb5#
Bh8+
Qhe8+
Nfxe2+
Qcd6
R4xf6
Qbe7+
Qc8#
Re1+
dxe7+
Na2+
Q8e3
Qcg8#
Nec4+
Nxg1
R6f7+
R2g5
R5d6+
Rbxe5
h8=B+
R2xe3+
R3h7#
Qxb2
R8a7+
Rdxa3
R8g3#
Qee6+
R7xh5
Rab6
N3xf5
R8g6
Nge4+
Q8xf4
Qexg4
Kb6
Qc2
Qfd6+
Nd5
Qgxd6
R7xf3+
Rcb6+
Rxe3+
Raxh7
N5f4#
Rfxf4
Rxb2#
Qxg2+
Raxe1+
N7xf5+
R2d6#
Qab2+
Qcxc1+
Raxh2
Qxe6+
Re3#
Rde4
Kxh4+
Rch8
Nxg8
Qef5
R4xe6+
Qhh2#
Qgh8
Rcf6
Qgc6+
R5xd3
axb8=Q
Rc2
cxb3
R2g4
R8b6
Rbe4
Nxd4
Rcxc7
Rba1
Qcxa2
Nb3
Qdd2
Qbb8+
Nexd3+
Qaa3
Qba4
R1f4+
Bxb3#
Nhxf8+
Q3xh8
Rhxe5+
Qfe1#
Q8g6
R8xa6
N2xb4
Bxh5+
Rexa8
R7f4+
R7h2#
Rfxc3+
Rgg5
Qdd8#
Ne6
h1=R
Q2g5+
N2xa3
Q2f3
Qba2#
Beh7
Ncxd8+
N7xe5+
Rcxd4+
Qaxb7+
Kc6
R6xh2
Nef3+
Nh6#
Q8f4+
Naxb6+
c1=Q
R6xc5+
cxd6#
Nec3#
Naxb2
Rgxh4+
Rxe1#
R4f6+
Nxb6+
Rhxb8
R1xf5+
Rd1+
Rfg3
Qgg4
Rfb2#
N6e7+
R3g6
Qgc7
N1a3
Rbxa7+
Nxd4+
Qgf7
N3d4
Nfe5
Rhf3+
Rdxg2+
Kh3
R4xc7+
Rhf8
Rgf8
Rbe8
Qcc1#
Bf4#
Nxf8
R1f5
Ne7#
Q1e1
Rxh1#
Nhg6+
Nca5
N4e5
R1a4
Nh3
R5f6#
Qexg6+
Bxa1+
bxc5+
Ke6#
N5xe3
R8xf7+
Q5xc5#
Nfe4
N3f4+
R3xh6
Rbxb7+
Re1
R4d2+
N4e6+
R4f7#
Nfxd3+
g5#
R4a5+
Qfh7#
N6a5
Q5xg4+
Rdb6+
Nhxg4+
Qd1+
Ncxd2
Rce6
R3e6+
Bxe2
Qcxe4+
R3xd4+
Rf8#
Rfe6
Bhg8
R1b4+
Qhh6+
c2#
Rag1+
R6xe3+
R6c7+
R7xf6+
Ngxf6+
Rxa5#
Nce3
Rh1+
Qda3+
Rfb8+
Q7xf7+
Rgxf3+
Qbc6#
b1=Q
dxc4+
R7h2+
Rbxh1
Q8d6#
Rcxd2#
Qeg6
Rge1#
R7xe4
Qbf4+
Q7e6
Rcb8+
Qea8#
Rfe1+
Rhxc4+
Raxf7
cxd8=R
Q1c1+
Q1b1+
Rfc3
Qff2
Rdd5+
Rbxh2
Nfxd6+
Qxf4#
R8h3
R8h4+
R5xf3
c8=R
Ref6#
Rexf5+
Rcxg2#
R5xd2
Rae7+
R2xe4
e4
Qaf7#
Raxa6#
Qa8#
fxe8=Q#
Nce2
Qe7#
Rga5
Bh3#
Rxg2
N2xh4
Rba4
Q2g5
Qcf6+
Q4g3
Qgc5
Raxf8#
Be2+
Bxd8+
Qdh5
Q3d3
Ke6
Rce5
Rfh3+
Rhb1+
Bb7+
Qff1#
Ba8+
Nca6
R7xf5
R8xe2
Ndxe4+
Qca1#
Qaxa7
R7xh5+
R2xa3
Ndf1+
Rbxa4+
R4d6+
Qag1+
Qdxd2+
Rcxg4
Rga3
Qg7
R1xc5
Rbe6+
Qexf6
R4f5
Rcg7+
Qxg8+
R1xh4+
dxc1=N+
Rcxc8+
Bf1#
Qcc7+
d7
Kxh7
Rhe3+
N3b5+
Qfd7+
Rcxb7#
Nb5+
Rc7+
Bxc4+
Qbc2
Qxc4#
Qgxd5
Raf7
Qge8
Bc6+
Rdxc6
Nfe8
Q3d1
Rdg6
R8xd7+
Nbxd3+
Q7b2
Nxf2#
Qaxb3#
exf1=B+
Qac4#
N6xh5
R8xg6
N6b5
Rfe5+
R5h3#
Rfxf8
N5xg4
Qbh8+
Qca2+
gxh8=B
dxe2
Q8d5
Rdxd7+
Rea3
Qhc4+
Rfxd4
R5h2
Nxg5
Rhxd7
Rbxh4+
Qea1
Qge8#
Qhd7#
Nhf5+
R2xb4+
Ndc6
N4c5+
N4xg3
R1h6+
Neg8
N1xa2
Q1e7
Qcxf4+
R3c6#
R4xe7+
Kg2#
R1h5+
Bxh7
Rhxd4
Nb1#
f7+
R1xf6
Rxg7#
Nbxc6
Rbxc1
Bxe2+
Rge2+
R3f5+
Q1c2
N7xh6+
R3xf2
h3#
Rbb7+
Rexf2#
Nec6+
Qd5
Ngxe6
Rf3
Nge3
Rbxh3+
Qb6
Raxd7+
Rdxa5+
R6xc3
Raxa2+
Rbxh4
Rbc6
Rhc6
Reg6#
Qbd8+
Nac1
Re2+
R7d5
R4a5
R4c6
R2f7
Nab6+
Qfg6
Qaa5#
Qfxe1+
Ndxe7+
Rdc6
Rdxc4
R3b4
Qbe2#
Rgxh7+
R1xd7+
Qf7+
Rxc8
Ndxb2
Bh2+
Rhb6+
R3b5
Nb3#
Rhxa7
N7g6
Nfxe8+
Q7d5+
Rgd6
Q8g6+
Neg6#
Nhxg8
Qbc1
Ncxd5+
Nfe7+
Kxb5+
Rbg2#
Rdxe2
Rae5+
h6
R1d5#
Qhxf1#
R6h2
Qgd8+
Rcg2+
Qac8
Qdxf5
exf6#
Nxa2+
R3xh2
Qgf6#
Qfxc4+
Q1d5
Rc4#
Q8a6
Bxg3#
Rexe6#
Rexh6
Rce6#
Rdd8+
R1xc3
Rexb6+
Rbxf5+
Rcxd5+
Qfe2
Rdxh2
Qag6
Nac5
Kxc8
Qhc6
Rfh4+
Kxf2
Ngh8
Rdb1#
Reb3+
Bb1
R3xf5
Qc7
Rfe7+
Qfa7
Nhf2
Bf2+
Bhd4
R1xe3
Na7#
Rfg8
exd3
Nbxc3
Rxc6+
Qbxb4
Raxd2#
Qh4#
R1d7+
R1xd6#
Qdg3#
Qgh7
Qc6+
Qhf4+
Qxd1
Ncb1
Nbxc4+
Bd4+
b8=R+
Qbxe8#
N4xa6
Rbc1
Qfxb7#
N3e4+
Raxf6+
Rxg4#
Rgxc6
N5d3+
Qg5+
Qed1+
Rff6
Rxf5+
Na7
Kxc2+
Rgxg8#
Kxa6
R4h6+
Qcf1+
Qfa1
Q5g4
Qfc5+
Qah8#
N5xb6
R6b5+
Nxh2
N3xb4
Ref7+
Qbb7#
R4xb7
Rfa7
N7h6#
Q6c3#
N2xh3+
Rhb8
R1f3#
Qxg6#
R6b2#
Qfh2+
Nexg6+
Qhh2
Qec2
R4a3
Nba7+
N7b6+
Q3d3+
R7c4+
Qf5+
R4d2
Rf4+
Na6+
Qfh5+
Raa5
Nbxd6
R6xc4
Re1#
Q8g8+
Qxa1#
Rfxb8
Rdxh3+
Qxb4#
Qeh4
Rce6+
Q3e4
Nxc3#
R1e7+
R7xb5
Qfxd2#
Rbc7#
Qd7
R4g5+
R7f6+
Rbxe7+
axb5
Rfg6
axb1=R+
R5g6
R3a6
Qee5
N7xe5
Nfd2+
Rexc6
Ndb6+
Qdb5+
Bxg5+
Qexe1
Kxa8
Rgb6
R5b4#
Qdxd8+
Q8xc3
R1xc6+
Qcxd1+
Nxf5+
fxg5#
Q4c5#
Rhxg8+
R3e4
Qexe8
Rdxf5
Q4b5+
N7xb6
R8xd5+
N4xb5+
Rxa3
Qdxg8
Raxb2+
f5#
Ref3
Qbc5
Ncxa5+
R4f7
Bbc4
Rfg6#
Qdxd4#
Rgxc7#
Qae4+
R2xg3
Kxg4
R3b2+
R4xh2+
Q2f1
Rcxe5#
R3xe4
Qff8
Nab3
Rexc3+
Rfc5
Rde3
N4c3+
N5h6+
R6e7+
Rcxb2
Qbh8#
Rh6+
Qxf7#
Rxg4
Rcxf6
Rxh7+
Rfxa7
N4xh5
Ncxe4+
Qdg7+
Qcb6
Rh8
Qgxe6+
R2xe3
Q1g1+
Rbxc3
bxa4
Qxd5#
Rdxa8
gxh7#
Rdxe6+
Rfe6+
R6a7
Q1g3+
Qdxd7
Q5b4
Rgb8
R3c7
Bde7#
Rae6
Rbxe3+
Rgg1+
Ke2+
N8xg7
Rhg5#
N6xf7+
Q6d7#
Qxf2
Q8g4+
Raxg1#
Ke7
Qcxe7
N5xa3
Qda6
Bh6+
Bd1#
R3xg5
axb7
N2e3+
Qhxg1+
R7a3
Nab6#
R6c4+
R2c3+
N1b3+
R7xc5+
Nxa2#
Ref6
Qdxd3+
Nd6#
dxe1=B
Rfxb1
Qxf2+
Ba1
Rxa4+
Qgg4#
Qexb5#
Qdb2+
R3xa5
h1=Q
Rexb2+
Qdb7
R3e7+
Nbxd2
Qhe5#
h5+
Qgxd8
Qaxb7
Qg5#
Qgb2
Q8xb7+
Kf3
Qfa1#
R4b5+
Qxc1#
Qec5+
R2g5+
bxa8=R
Qfxc3+
Qch2+
Qexg2#
Qgc5+
Rae1+
R6xb2+
Qca5+
Rgxd2+
Ndc5
fxe5#
Rh4+
Rce7+
Rxd4+
Qcg1+
Rbxh2+
Nf4+
Q1xb5+
Rhb2+
Qgd5#
Rfxf8#
Q8c4+
Rcb7#
Qeb3+
Nab1+
Rgxa7
Nd6+
Raxc8
Nfxe6+
R4f3#
R8b7+
Qef3
fxe8=B
Rfc1+
Q1b7+
Qhc1+
Qcc8#
Qad6
Raxf5+
gxf4
N6xf5+
Qcxc4
Nexg4+
Q1d3
Qdf4+
N2xb4+
Qxa3#
Qbf7+
Nba6
Q4c5
Rdf2
R8b4#
Bxf3
Ngxh2
Raxh2+
Bb2#
Rdc2
R1c6
Kxh5+
Qae1
Kxf5
R8g2#
Rgxf4+
O-O+
Qcxc3
Rxd1+
Nbxa2
Qxh7#
R6g7
Ncxa5
R1b5
R3d5+
Na1#
R1e7#
Rexa2
Rfd6
Rcxa4+
N5e6
a8=R+
Nce7
N2e3
R2xd3
R7d2+
Reg8+
Rgf7#
Qdb8+
Na6#
Qbg4+
R8xe3
Ke7+
Qca5#
Rhd4
Rbc4
Qaa8+
R1g7#
Bg6#
Raxf1
Qa2#
exf1=R#
N7xc5
Qxg8#
Rbg8
Kc3+
Qeb7
N8xg6
d7+
Rcxh4
Qaxd6
Rexh1
N2xg4
Rxd8+
d6#
Naxc6+
exf8=B
N4g6
Qfxf1#
Rgxb8
Rexg4#
N7xb5+
Nge1+
Rdf7
Rbg4+
Qhh4+
Qeg7#
Rac3
R2a7+
Q1b3+
Kg4#
Rbd6+
Rcxc1
Nef5
R5xc6+
Nde6
c1=Q+
R8d7+
Qxc5#
Qfxf3#
Raxh5
Qef1+
Qf4#
R5xh6
Rde5+
Nxd7
Nxe3
Rcxd8+
Rch3
Nbxa7+
f1=N+
Rbf4
Rb8#
R7xc3#
R7xg6
Raxg7+
R3xf6
Rxh6+
Qh7+
R7xc3+
Rha7
R8xc4+
Qxg3
Qdh3+
exf8=Q
Kc1+
fxe1=B+
a1=Q
Qxf3
Qa6#
Rfd3+
bxa7+
Nfxe3
R6d3+
Ree3
N3f5+
c5
Rfb3
Q8f8+
Rca6
Rgh8
Nef8
gxh3+
Nhxf4+
Qca8+
cxb8=Q+
Rxf8
R6xg4
R4xb7+
Ndxc5
Rdxf6#
Nef1+
Rd5+
Qeh2#
Red5
Rexd3
Qfc4
R8xf5
Qhb1#
Qbf6
Bxf6+
Rea8
Qgd2
Qbf5
Bf7#
Rcd8
Q2d5
hxg7#
R5xa6+
R3xb4+
Qbg3
Q3a3#
Qch1+
Qg8+
Ref7#
Rdc4
Qfb4
Q1xf3+
Q8xa2
Qfg2+
Rxd2+
R6xh4
Nb7#
Nxg8#
Rda1
Q1b4
Qe5#
Rgxe4+
Rcxg5
R4h6#
Raxd3
N8h6
Qxh6#
gxf1=R
Qfb5#
Rcc1+
Rgxc5+
Q1e4
Qeg4+
dxe4#
Qgg2#
R5d2+
Nfe3
R8xh3
R6e5
Qexf2#
R1xf6+
Nbxc7
Qbd1
Qfd3#
Ngh7
exd2+
R7c5+
Qcxc5+
Bh1+
Rxd8#
Rhe3
a3+
Qxd2#
N7xd5+
Qge4+
Bb5
Rf5#
fxe4+
Rbxc7
Nfxd7
Naxb4+
R2g3
Rhb7+
R1xb6
Rgf4+
Reg3#
Ncb7
N8a7+
R1xb2+
Bxc5+
Rfd5
Q4f8+
Nxd1
Nab7+
Rhd3+
Nbd7+
R6d2+
Kd5
N6xe5+
Rba6
Qxb2+
e2
Qge5+
dxe1=N+
Rcf5+
Nb8#
Qce8+
R1xg3
Rbxd8+
R5g4+
Qde3#
Qxb7
R1xg6+
Rhe7
Q8f2
N2xc3
Ndxc4+
Q7a7+
Rbxg4
cxd1=R
Rdxe8+
Rfd7+
Kd8+
Rbg5
Qb7
Qea4#
Rbxf3
Rhxe8#
N7xf6
Rgf6
R6e7
Qed6+
bxa1=N
bxa2+
Q1xe3
R7g5+
O-O#
f4#
Qcc1
R2xa3+
Rcxf5+
Rcxh2+
Rbg8#
Qag1#
Qha8#
Rbh7
R7h3
d1=Q#
Qgxd8+
Qha5#
Rcxe8
Ngxh4+
R7d3
Qaxa2
Nfxh2+
Qb1#
Raxb7+
Qe6+
Qhxd3
fxg8=N
Rfxd7
Q3c5+
N5b4+
R1e7
Qgh5
R7xg6+
Reg2#
Nexc5
Rac6
Qcc7#
Ngxe6+
Qbxe7#
Q4e6+
Qgd1
Rdxf3#
Nexc3+
fxg3#
Qxg8
Nxc5#
R5xb7
d8=R+
N4xf5
Bxh6
R1h5
N6f4
R2e7#
R1a3
Q6d6#
Qa4
Q8b3
Q4xc6+
Rec5
Rfh4
Qd3+
Rb7#
Q6e5
R6g2+
R4xb2
Rhxh7+
Qeh1#
Ngxf6
Rfb6+
Qch4#
R8xd3+
Rd7
g3+
Nge2
Bb6#
Qbe2+
Rexd6+
Qdf4#
R6e3+
Q3b2#
N7c6
Qbc7+
Qexd3
fxe1=Q#
Bad5
Qhc8+
Qhf5+
fxg2
Q4g6#
d8=N+
Qfd2+
Nhf6+
Qff2#
Rxc1+
Qgd7+
Kxb4
Bxf8
d4
Q2xe2
hxg8=R
Rhxe8
Bxb5#
Qg7#
Nexg3+
Rgxe1+
Rfxe3#
Nce4+
b1=Q+
R8c7
c4+
Qhc3#
Qab5#
R4xb3
Qhd2+
Qac4
N1xf2
d7#
R7xd3+
Q5g5
Qxb1#
N7xg5+
Rec3+
Kh4
Rfxg4
Rexg3+
Qdxd1
Q1xd7
R7xb2
R6b3#
Qxd5
R7f4
Ra7
Rexe4
Kc6#
R4c3+
Qf6#
N8b6
Rhe1#
Qdc5#
Rch7
R3xc4
Nxc1
Rhf1
Ncxb7+
R4xb6+
N6h7
Rcg8#
N8a6
Qa8
Rdxd1
Raxg4
Qxg5
Nhxg3
Nxg7
R2xd7
R2c4
Qhxg3
Qee6#
cxb6
Raxg4+
Qxg1+
Rexe7+
Nh3+
Q8b8+
R5xh7
Rfc7#
Q1b6+
Rh7#
Rcxh7
N5xa6
Qfh3#
Rdxd8
Rge1+
Ncxa7
Rgxd4+
Ncxe1
Qcc3#
Bh3
Q1xe7
R4g7+
Qed1
R1b4
Rgxb3+
N2xg4+
Rbd7+
Rxa2#
Rfd7
R8h6+
Kxh7+
Qhg7
R1xc6
Raxe5+
N1h3+
Rae7
Qxb2#
Rhxc1+
cxd1=R#
Qxc4+
Q4xd1+
Nce7#
Q6xd6+
Qc1+
R7f2#
Bxe6#
Qhxb1+
bxa8=Q
R6f2+
R5a3+
Qdd3+
Ncb8
R5a7
Q5g8+
Qae8+
c7
R2g4#
dxe1=N
N4xg3+
R5xb6
Kg6#
Qh1+
Rge4
Rfxf2#
Kd7
R1g4
R5xe7
Q5xa2+
Q8b7
Nba4
Reb1
e7+
gxf1=B
Rhc2#
Q6f3#
Qdxe3+
Rxg2+
Qcxb3+
N8e6+
Rdb7
Rab6+
Nac4
Rgf2#
dxe1=B+
R2xd5
N7xf6+
Rcb1+
gxh4
Nxf2+
Qcf3
R1xa4
Qde5+
Rfa4
Qab1
N4c3
Rhxd6
Ba3#
Qac2
Rce5+
Kd2+
Rbb4
Bxb5+
Qcg6#
Qdxb2#
N7b6
R4b7+
Ndf1#
Qec3+
Qee8
Qaxe4+
Rfh8
Ngxf7
Q7e5
Nge4
N8xe7+
Rdb2+
Rdxe1#
Qfc3
Rbxa1
Qag7+
Q5xe3+
Qxc5
dxe1=R+
Rgc6
Nfxh1
Rb2
Qee1#
Rcxa1
Nf6#
Nxc7
R1xd4
Ndf1
Rxh3+
Rxa1#
gxh3
Q5xa2
Rexa7
Qge1
R2f3
fxe1=R#
R1b3+
Qcxg4#
N1xg2
N3xc4+
Ra3
Kxf1
Qxd1+
R2b3
N3g4+
Qda2#
N4d6
Qbxd7
Rha8
Qd6
Qdxh5
Qad5
R6xb4+
Qg6#
Rbxe1
Nd7+
Qbh2#
Rab4+
Ng4+
Rhd5+
Nb1+
R6xh2+
Rba8
R5b2#
Rh6#
Rbd2+
Qgb8#
Rfxd3
Rxe8#
R8xe2+
Qbxe8
Rgc1+
Q7d5
Nxe2
R1e3+
Qbxe8+
Nxg8+
Rhf6#
exf2+
Rff2
Qcb2#
R5xa4
Qff4
Rfe3
Ra7#
cxb8=B
Reg7+
Rdxg5+
Bd2#
Rgxg8+
Nf1
Qae8#
Ncxe4
Q7g2+
R5h2+
Q4h2#
Bxb2#
R5xc3
Rbxf2
Rcxb4+
Qgxd8#
Nge6#
Kxb6+
N5xh3
R5xa6
R3f6
Rf8
R1xg7+
Qgg2+
Q3f6
Rbf8+
Qch6+
Rfb5+
Ne2
Rxg3+
N2d3+
Qgxd7+
R5xd4+
Nxa2
e5
R5e2+
R1xd2
gxh8=N+
Rhg3+
R5xd7
e1=B
g2
Qeh3+
Raxf2
Q4f5+
Ne5+
R8e3
Rdxd4+
Rhxf4
R7g2#
Nec3
R5e6#
Bxh7+
Rhc4+
Qfxb1#
Ngh5+
Qgf3
N1xb3
Qbxf5
Ndxb3+
Nexf1+
Ree1+
Kg3#
Qhxc8
Bxa6#
Ngxe8
Qfa4+
Raxe2
Qexe3+
R8xb6
Nh2+
Ngf6+
b8=B
Nfe8+
Rexh3
Qf1
R5xd4#
Rag4
Ndf4
Rexd4
Bxg7#
Nd1
Qgxb3+
Rdf2#
R2xg5
Bxe3#
Qa2
Rcxd6+
N5f4+
Rexd5
R1e2+
R5xc4
R2xf4
Rha5
Q4c3
Bd4#
Rgh6
Naxb5+
Ndxe6+
R3g4#
Rexg5
N4xd3
R7e4+
Rac3+
Qag2#
fxg6#
Qfxh3
Rfxg8+
Qgg7
Qbg7#
Nc1#
Q5g7+
Rexc2
R3xg4+
Rfxc7+
Qfa1+
exf7#
Rce3
Nexf4
Qbc4#
b1=N#
Rge5
Rg2+
R5c7
Raxc7
Reb5
Qc4
Rhc1
Nc4+
Qxb3#
Nxg4#
Rbe2#
R6e5+
Q8h8
R8d7
Nbxd7
Rexg6+
Reb4+
R1xb7+
Raxe8#
Rae4+
Raf7#
Rcb2+
Kg1+
Qxc6
R6xd2+
R3h6#
Nhxg7
Ref8
Qfb6+
Qad1+
Rcxf7
N5g3+
Raf5
Rc1#
Ra3+
R4xd3+
Naxb3
Qhg7+
R4xf3
Nexf8
a8=N+
N8g7+
R1f2+
R3d7+
Rfb7#
Qaa3+
Nec3+
Rfxb3#
Rcxh2#
Reg2
Qc5#
Ngxe8+
Qdb4
Rcxg3
a8=Q+
Bg6
Qec8
N5e4
Qfe7
R8xd4+
Rhxd2+
Qce6+
R8g7+
Q1e5
N3xc2
a8=N
N3g5+
Rfxc5
Ndxc2+
Rexa6
Ng7
exd1=N
f6#
Rab2
R1e3
Ncxa4
Ndxc8
Qe7
gxh8=Q+
Red6+
Rhe4+
Bxe8+
N3h5
R4h3#
Bxh2+
Rcxd3
Rbxe6
R8e5
Rcd2#
bxc8=Q
fxg1=R+
Qdxd5#
Ndxf6+
Ndc2
Rf4#
N8f6+
Qdg2#
Qgb5+
Ra2+
Rhxg3
fxe1=Q+
Rcb4+
Rbxc5
Naxc2+
Qhd2
Rec8
Rbxd7
Rbxe8
R6e3
Rbxb4+
Rhxh6+
Rbg1
Nac4+
Rxg5
Qhf1#
R5c2+
g1=N#
Q1d3#
Rbxg2#
R4e7#
Ndf8+
Kxc1
Bxc2+
Qga7
R8f2
Nxh6
R7b5+
Rhxf1
Rcxf1
Raf8+
c1=R
Q3c7+
Ned3
Rxf1#
Qxe5+
Rb4+
Bc7
R4h3+
Qde6+
Reg5
R4a3#
Rdxb2+
fxe5+
R3c7+
N2d3
Rc7#
Qc3+
N8g6
Qhxg3+
Qcf4+
N8g7
Red2#
Bxa3+
Q8c8
Qxh1
Rgg1
R4xa5
gxf3
Raxa4
Qaa5
Rde3+
Rbxd8#
Rhxg2#
R5c6+
R8a5+
Kxd6+
Qcxe6+
Qea7+
Reg1
R1d3+
Rba7
R6e4
Rfxa5
Ra6#
N2d4+
Qch6
R2a6+
Qaa3#
R8d2
g6+
Nbc1+
Qdb2
R2e5
Nxa3+
Rcxd1
a6
Raxb3+
Rgf5#
Bc3+
R1a2
Rh8+
Qbxb5#
R4xf3+
Rhxa1
Qfxf8
Rfxf2
Kxb4+
Rxh3
Rbe7+
Nhg1
Ba2#
Ndc7#
gxh1=Q
Raxf8+
Rxd3+
Kf1+
Rdxh7#
Qgd7
a8=B+
R1xb5+
Rhxe2
Kb2
Qgc7+
Qexf7
Qcb5#
Qcd4+
Qge8+
e8=B+
Qef7
Rce1
R5b6+
R4h7
fxg2#
R2xf7+
Nbxa4
Nxc6+
Qexc2+
Q6d5
R2xd7+
Rdb4
Rhe4#
Rxe5
Nab8+
N7xe6+
h2#
Bxd5#
cxb2
Rdxa2
Q4d3
R1e2#
R5g2
c8=R+
Qde2
Qfxe7+
N3a5
Qexe5+
Nb7
R8xb5
exd6
Rbb2
N8e7
N1h2
Bd3+
Nbc5+
dxe6#
R7d2#
b6
Rag5
Nge8+
Rdc7+
Q8e4+
Rcxc4
Qea7#
Kf2#
Rbxd5
N2xg3+
Rbg7#
Qgf1
R3xg4
Nde7+
R4d7
Ree4
Rexc1
Rexb1
Q5f3
R8b3+
g8=Q#
N5b6
Rdxd5+
Rexb2
Ree2
Rd3+
Nhg7+
Kxe3
Bb8#
Q8b8
Q5f7+
Rhxc2+
exf8=N+
N4c6+
Bh7#
Rgf2+
Rd1
Nf5+
Bxc7+
Rdxh7+
h5#
fxg8=Q+
Q3f3
Qbh8
Q7xe4
Rcxh3
Reg6
Bf4
Qad2
R2f5+
Qxd2
b1=B+
Qxe7+
Bxf1+
Bh3+
N1h3
Nxe7
Qhxh7+
Ref4
Rcxg6+
Qeb5
Rcxf3+
R2f3#
Reb7#
Bh2
Ree5
R6e5#
Rhe2+
R4d5+
Qag6+
Nac2+
Rfxb2#
Rgxb5
Nc1+
d1=R
Rag2
R4xa2
Nxh1+
Qbh7
Rhxf5+
Ra2#
Bhe5
Qexc8
Ngf2+
Qbe6+
Kxe8+
Rba5
R1c5+
Ree1
Rhg7
Bxg7
Ndf5
fxg4
Ned4
Rbxd5+
Rad7+
Ngxh4
Qga8
Kc7
Qxf6+
Rdb5
Qhxg8+
Qgh2
Q8b7+
Ndxb7+
gxf2#
g1=Q#
R1xb4+
Rbg1+
hxg8=B
Q6g1+
Ndxb6
Kxg5
Rbxb6+
Qdf1+
Nfe5+
Ncxa4+
Q1d1
Ngh7#
Qcd1
Qef6+
R8b5+
Rag8#
Ned6+
Qbf7#
Rdc5+
Rgd2+
Ndxc4
Nxe4#
Ngxf2
Qbb8#
Nd1+
Qbd7
Qxa3+
R6h2#
R3xb5
Qec6#
N6xe5
Rhxd4+
Kxh6+
Qbxd3
Rcg5+
Qea8
Qxh2
Bxa7#
Rxb2+
Qff5#
Qaf8+
Qhd3+
axb4#
Rbxg7#
Rfxe8+
Nef5#
Rfd5+
Naxb7+
R1e6
Rbxe6+
R4xc7
a8=B#
Rdg7#
Bd6
Nd8+
Rfxg7
Rxc3+
Qfxg4+
R5e3
Rfd2
Ka5
Qeb4#
Q2c3#
Qeb4
Qaxa5
Rgxf8+
Nhxf6#
Rbxd6+
Raxd3+
Rhf7#
N2xe4+
Nc5#
bxc1=N
Rgd8#
Rxf3
Rg7+
Rbd6
Qbe1
R7c4
Nf7+
Raxb2
Qad1#
N7xd5
Reb7
R6xb4
Rcb4
axb3+
Rexa4
Bxh4+
Rg8+
b1=R
Nhf6
axb8=Q#
N2c4+
R5d7
Ng7+
Rcf2#
Rab2+
Qdxb2
Rbxg4#
R7f3+
Rxh4#
Ka1
Ngf4+
Rfg5+
Raxb5+
R4f3+
N5g6#
Nce6
Nxg6+
R6xa3
Qdxd5
R1a6#
R7c6
Nexc3
Q8g4
Qdxf4
N1g2
Nxa1#
Qbxc7
Nhf3
gxf2
Rh2
Rgxd1
Rdd7+
Rcg3+
fxg8=R+
g4#
Rgb2+
Qaxg2#
Ng6+
Rexf5
R1g3+
Rdxc3+
R6h3+
Raf8#
Qhe3+
Qbb6#
Rec7+
Qaxe5+
Qgg1#
Qhh1#
R6xd2
R8e6+
Rfa5
Qgg1
Nxb2#
Qhf2
Q8d2
Bxf3+
Q1xa2
R4e5
Raxg5+
Nbc2+
Rexe2+
Qbxb2+
Qe5+
Rae1#
Qcg1#
Rxf4+
Kd8
Qcb3#
bxc4
Q4f3#
h8=N
Rbxa8
Bxg6+
Ndxe3
R8xb3
Ngf1
b2#
Q2g7
Qbb3
Rb8
Qce3+
Qgf6+
Rexe2#
Bxd1
Rab2#
Rdxh8
Nexc5+
Kxa4+
N8c7
Qhxe3+
R3h7+
Qcg3+
Rgxg2#
Rxd3#
exf7
Be3#
Rxa4
dxe8=Q#
dxc2#
R7e3#
b1=B
Rexb5
Ned8
Rc4
hxg8=R#
Ref3+
R7f6#
R1b2
R1xa7
Kxd5
R3h4+
N4xe5+
R1xc5+
Rce8+
Rhxe6+
Rgxf1
Q1b3
Rdxg6
R6g4
Qcxb7#
Qfxb2
Rcxa6
N4h3+
Qdd4#
exd3+
R6xe3#
R5e6+
Rhxd3+
Q6a8+
Bxd3+
R6h4
Rgb6+
Rcxd8#
R5xd7+
Qcg2+
Rgxc2
exf8=R+
axb1=N+
Be8#
Qgxg2#
R1d7
Rcc7
Qaa1
Qfe2#
R8xb2
R7d6
Qcd2+
Qga2
Rxc4+
Be5
d3+
Rdh1
Rh7+
Qexg2+
Rdf4+
N5xe4+
Qed4+
Rb7
Kf1
N1b3
Qg2
Qed7+
Bc5
R1xf2+
Reh5
Rcxc2
e4+
R6f4+
a4#
Rbxd8
Qab3
Rfxd6+
N2c3+
Qxd4#
Qcg1
Nxh4#
R2xg4
Rxb7#
Rgd4
Nfxe5
R5h3+
Nh6+
e8=N+
dxc3+
R4a3+
Ngxe3+
Qfxg5+
N2a3+
Qhxd6
Qde6
Rhd2#
Qaxa7#
Qhxg4+
R6c7
Rgf2
R4a2+
Qdc4+
N3xe5
Rfxh5#
Rfd3
Rcxb2+
Ndxf3+
N4b5#
Qxb3+
Rfa8
R2f7#
gxf5
Rd6+
Rcxe7+
Qxe1#
Nca3+
Qgxf5+
Qca8
R1e5+
Q1d7+
Nhxg4
Q6xg7#
bxa8=Q#
bxc8=R
Ncxe5
R7g2
gxh1=N+
Rgxc3
Rfxa7+
Rgg3+
R7e2+
Rcxd1#
Nbxa8
Rfxd2
Bxe7#
Ncb6
Kxe6+
Q3d4
Qaa6+
Qce2
Qfxe4
Qg3+
N2c4
g2+
Qe2#
Qxd3#
Qdf7
Rdd3+
N3f4
Rc3+
Rhxg8
Q8e7
Nexc4
gxh3#
Raxe2+
Qfc5#
Qhxe8
Qgxg2
Qab2#
Nd4#
Rbxb1
Rdg8+
Qdf3
Qhxc6
Qcg6+
Rcd1
Qcxb5+
Rbxh6+
Qg6+
Nxd8
Qaf6#
Nfxg5
Qexd7
Qdc8+
Qdb3+
Qef2
N2a4
Nbd6
Q6h4
Ra3#
Rhe6+
Rdxd8+
Q1h3#
Rfg6+
Nexd4+
Rf7+
c1=B
Rah6
Ngf3
R6g5+
Qxc2+
Rexf7#
R3xg2
Qfxe7
Qcxf2
R6h4+
R1xg5
Rxa6+
Nf3+
R4f2
Rhd7+
exf1=R+
Qhd3
Rah8
R2f7+
exf8=R
Qgxd1#
e7#
Q2h1#
Qdxf1+
Qfxa2+
c8=N
R4f6
Rcb2#
Reb2#
Ncd6
Rhxe3+
g5+
Qcd7+
Rg8
Rdxg8+
Rcxg8+
Rfb4#
Qexf1
Rexg2
Qad8+
Rg5#
Q2f7#
Qfc8+
Qa5#
Bxg8#
R8h7+
R3xc2
N7h6
Rdd7
N7h6+
Qff8#
Rxd3
Rge3
Ngxh6+
N5b6+
c3
Rgxe8
R3f7#
Qed3
Qe3+
Rdxb6
N5h4+
R4c3#
Bxf8+
Na5
Rxc4
N1xc2
Qdc7#
Rhxg6+
Nh7
Nxa5+
R2b4
Nhg8
R3e2#
Rgxe8+
Rxb3
Bxc4
Qb2#
Rdc1
Rgg8+
Qb6+
Qhh3+
Qbxc3
N6g5
Q4h1#
R8xf3+
Nbc8
Rdc4+
Qfb4+
Rg2
Qxa7+
Ndxb4+
Qhxe6
R8f5
Qgg3+
Qgg1+
Nbd2+
Rg1
Nhxg3+
R1xh7#
Rha2
Qd8#
R2g3+
Qef8
N1xb3+
Nd7
Nxc4
Nxa4#
R3g4
Rad5+
Re6+
Qed2#
R5e7#
dxe2#
Kg7+
Nbc3+
Kc8
R3b6
R6xf7
Nab3+
Qhxf6+
Rec2
N5xg6
Qdd2+
Rdb1+
Rcxf2+
Rbe5
Ng2#
Qxf5+
R8b3
Rcxd3+
Raa8
Rdd5
N4d5#
Ndf5+
Qfg7#
Rdxg8#
R1xf4+
Nbxc8+
Rde6#
Red1#
Rgxf8
Bh2#
R1xg2
fxg4+
R7xd6
Bxa5
Rf1#
N1c3
Q8xd6
Nxd1+
fxe4#
Qdd8
Qcxb4+
Rdg5#
Rdc2+
Rfb2+
Rdxf1+
Qcg2#
Raxc8#
R8h5+
Ka2
Qch8+
Rfg8+
Kg1
Qcb4#
Nxa6+
cxb8=R+
Kb5
gxh6
gxf7+
Rgxd3
R6xc3+
Q4g1+
Rbxg6
R8h6
Rbg6
Kxf8
Qcg8
fxg8=R
Qed4
Ndc4
Qgxg5#
Qea2
Nce6+
R1xh2
Qhxe7+
Rxe7
Qdxg4#
Ncb3+
Qaf3
Qxe8#
Rdc3+
Nfxh7+
Rhe7+
Rdh8
Rxa6
N4xh3
Nxc6
Rbxh6
Rgxd4
Qaxf7+
R6h2+
N8e7+
Rcxc7+
Nfd3
Qfc4#
Qfa6+
Nxc2
Qhxc7+
Rxg3
Ke1
R4d3
Ncb3
R5xf6
Ndxb4
Qhh6
N6xf7
Q8e3+
Bxg5#
Qba7#
R7xf2
Rcxb3
R7xd4
R3d6#
R7h4#
R2c5+
Qxg3#
Rfxd8#
Qde7
Rba3
Rac4+
R5xg4+
Q3xc3
Qxd4
R1xb7
N4b3+
Rcg6+
Rgxg3#
R2xd4+
Qb2
Bxe4#
Qdd8+
Rbxc8
bxc1=Q
Rcxh6+
Rac2+
Qxf8
N3b4+
Qfxg5#
Qh4
R8xc7
Raxf5
Ncxd6+
Rdxh7
Rf6+
Qxa6+
Rbxa2
Rcxe1+
Qee1
N4xf5+
Q1f6
Ngh6+
Rgc8+
Qfe7+
Qaxb8+
Rxh2
Qdxe1#
Qba8
Rxh5
Raxg8+
R8d2#
R7xb4+
Raxa7
Rhxc5
Rbxd3+
Nba2+
Ncxe8
Raxc2
Rdf7+
Rbxf1
exf1=Q#
Qcxc2#
Qdc7
Rbxc4+
R4xd7
Rbc7
N7xg6
Ngf8
Bxh8
Qgxf6+
Qbe4+
g7#
Qeb7#
Rdxe8
Nca3
N6d4+
R6e4+
Qae5#
e8=Q+
Qcxe6
axb3#
Rxb4#
R5xc7
Rcxc8
Kxg7+
Rfxf6#
Nhf3+
R8xd3
Kxc3+
Nbxc2
Q6c6+
Rff1+
Rg7#
N7d5+
Rdf4#
Rcxb3+
Rbxa5+
Rhxh2+
Qeg5#
R2xh3+
Q2a2
Bd3#
Rfxd8+
Rexe8
R2e3+
Nba3
Nxf5
Rhxd5+
Rhh7
Kxh4
Bxf8#
exd8=R
R7g6+
Rhxc3+
Rd8+
R4f5#
gxf1=N+
Qfxf4
Qdb1
Rdxd2+
Qbf2#
Rbg6+
Ndf2
Qh6
Rae3
fxg7+
Rca1
Rcb3+
R4xd7+
Rdg3+
Rcxg1+
Nxe7#
Rfc6
Qdd6
Qdxc3+
Qhxf5
Qaf8#
Ra8+
N3d4+
Ne5
N4xh5+
N7a5+
Q5h2+
Qgg4+
Reb4
Be6#
Nexd4
Rxb5
Bxb7
Bxc7#
b2
Rfxh6+
Raxd3#
Raxe8
Nfg3
Qaa7+
Nde5
Rab5
Raxa5
R1e4
Rbxe2
Qbg6#
Reb8
Ncxd7+
Qd5+
Nexg3
R8xa6+
R7xg2
Qgxh2
Rdxb7
Rfxb7+
R1h7#
Rbe7#
Rdxf1#
Q8h4+
Nef1
Bg4
Rfxf6+
Qdf3#
Nf1#
Ne3+
R7xb5+
Kxd8
Qde4
Rhxa4+
Q1d7
Ned5+
Nhxf5+
axb4+
Rcxh4#
Nxe4+
exd4#
Rhxg8#
Kb3#
Kxh8
Ngxh1
fxe1=N+
R1c7
Bxc6+
bxa5+
Kxe2+
Qcb7#
Qdc6+
Rbe4+
Rhxg5
Ngh2
Bg5
Ngxe2
Qfb3+
Rhh3
e8=B
Rgxe5
Qfxe2+
Rgxf7
Ndb4
Nexd6#
Qga8#
Qdf6#
R5h4
h1=R#
c4
Qfxf6#
Nbd4+
Qxd7#
N3h2+
Rxb3+
N6a7
Qfxg7
c1=R+
Ndf6#
Qbxf3+
axb2
R4xc5
Rfh7
Q7f5
R2xc4+
Rag7
R7f5+
Rbc6+
Rgxg8
Qxg6
f1=Q+
Qcxf5+
Raxa4#
Qaxf1
Nbd1
Raxd5
f8=R
Q5d4+
R1xg4+
Qeb3
Qhd1
Rac1#
Qbd1+
Nac6
Neg5+
Qbxf7
R5a3
N5h6#
fxg6+
Rgxb7
Qae5
Nxc3+
Raxa4+
Rbxd4#
dxe4+
R3a6+
Rdf6+
Qhe6
g8=N
cxb1=N+
Q8xe6
Raxb4+
R7h3+
Qaxe8+
Q5f4+
Rbxc8#
Qfc2
Q1f4#
R6xd7+
Red8
Ka7+
Nxf1
Rhxb4
Rch3+
Rdd6
Q1g3#
Qxg5#
Qfe8#
N8xe6+
cxb5+
Rdxc2
Nh8#
Rfh3
Qfe3#
axb8=N+
Rff1
Q3f5#
Nexf3+
Bde5
Kh2+
Q8xb6
Rfxh5
Rad2
Rde7
R7xh6+
g5
Rcxd3#
Qcd3+
R1xa3
Q5h4#
N7f5+
Nef2#
Qdxd4+
Rxh8#
Qca7+
Rcxd4
Rgh5
Rgxd6+
Nge7+
Qfxg3#
dxc3
R8xh6
Bd8
Rdxb1
Q8xf5
R2xa6+
N4xg5+
Reg4+
Qbc6+
Rbxf4+
Rgxf4
Qba4+
Naxc4
bxc8=N+
Raxe6+
gxf8=Q
Qgc1
Nxa5
Qdxe6+
Nexg2
Qge6#
Rhxc2
N3f2
Kxh3+
Qdc6#
Qgxb7+
R4e2+
Rbxe2+
Q8b8#
Nfxh5
Reh1
Qeg1#
fxg7
R7xg5
Raxa5+
Ngxf5+
Rfxg2
Qbxf4
Ncxd1
Qbg7
Nhxg1
Qcxf7
N2xh3
Q4xf6#
Nxb2+
N5h3
Qfxd6
Rab7+
R7xd5+
Qexa8
Qcf7#
Raxg7
R6a5+
Qhg1
Qfxf8+
e1=N+
Q1c3+
Qbxb7+
Q5h8#
Bc1+
R2f3+
Nhg5
Rdxe4#
Q8d3+
R5h6
R8xa2+
f1=B+
Qhh7
Nba8
Q2c3+
cxd8=Q
Rhxg7
Rbxf7#
Qgh3
Qda7+
Qcg7
Rexh6+
Rbxb3
N5xb3
Nf6+
R6xf5
Rgxd8#
Rcxe2
Qdh3#
R3d7
Qfe8
